# Advanced SQL: MySQL Data Analysis & Business Intelligence

In [2]:
%load_ext sql

%sql mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
            
%sql USE mavenfuzzyfactory

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
0 rows affected.

[]

In [3]:
%sql SELECT table_name FROM information_schema.tables WHERE table_schema='mavenfuzzyfactory';

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
6 rows affected.

[('order_item_refunds',),
 ('order_items',),
 ('orders',),
 ('products',),
 ('website_pageviews',),
 ('website_sessions',)]

## PART 1: Analysing Traffic Sources

### Assignment 1: Finding Top Traffic Sources

**NEW MESSAGE**  (April 12, 2012)

Good morning,

We've been live for almost a month now and we’re
starting to generate sales. Can you help me understand
where the bulk of our website sessions are coming
from, through yesterday?
I’d like to see a breakdown by **UTM source, campaign**
and **referring domain** if possible. Thanks!

Cindy (CEO)

In [37]:
%%sql
SELECT utm_source, utm_campaign, http_referer,
COUNT(DISTINCT website_session_id) sessions
FROM website_sessions 
WHERE created_at < '2012-04-12'
GROUP BY utm_source, utm_campaign, http_referer ORDER BY sessions DESC

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
6 rows affected.

[('gsearch', 'nonbrand', 'https://www.gsearch.com', 3613),
 (None, None, None, 28),
 (None, None, 'https://www.gsearch.com', 27),
 ('gsearch', 'brand', 'https://www.gsearch.com', 26),
 (None, None, 'https://www.bsearch.com', 7),
 ('bsearch', 'brand', 'https://www.bsearch.com', 7)]

### Assignment 2: Traffic Source Conversion Rates

**NEW MESSAGE**  (April 14, 2012)

Hi there,

Sounds like gsearch nonbrand is our major traffic source, but
we need to understand if those sessions are driving sales.

Could you please **calculate the conversion rate (CVR) from
session to order**? Based on what we're paying for clicks,
we’ll need a CVR of **at least 4%** to make the numbers work.

If we're much lower, we’ll need to reduce bids. If we’re
higher, we can increase bids to drive more volume.

Thanks, Tom (Marketing Director)

In [35]:
%%sql
SELECT COUNT(DISTINCT a.website_session_id) AS sessions,
COUNT(DISTINCT b.order_id) AS orders,
COUNT(DISTINCT b.order_id) / COUNT(DISTINCT a.website_session_id) AS conv_rate
FROM website_sessions a LEFT JOIN orders b
ON a.website_session_id = b.website_session_id
WHERE a.created_at < '2012-04-14'
AND utm_source ="gsearch" AND utm_campaign = "nonbrand"

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(3895, 112, Decimal('0.0288'))]

### Assignment 3: Traffic Source Trending

**NEW MESSAGE**  (May 10, 2012)

Hi there,

Based on your conversion rate analysis, we **bid down
gsearch nonbrand** on 2012-04-15.

Can you pull **gsearch nonbrand trended session volume, by
week**, to see if the bid changes have caused volume to drop
at all?


Thanks, Tom (Marketing Director)

In [43]:
%%sql
SELECT MIN(DATE(created_at)) AS week_start_date,
COUNT(DISTINCT website_session_id) AS sessions
FROM website_sessions
WHERE created_at < '2012-05-10'
AND utm_source ="gsearch" AND utm_campaign = "nonbrand"
GROUP BY YEAR(created_at), WEEK(created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
8 rows affected.

[(datetime.date(2012, 3, 19), 896),
 (datetime.date(2012, 3, 25), 956),
 (datetime.date(2012, 4, 1), 1152),
 (datetime.date(2012, 4, 8), 983),
 (datetime.date(2012, 4, 15), 621),
 (datetime.date(2012, 4, 22), 594),
 (datetime.date(2012, 4, 29), 681),
 (datetime.date(2012, 5, 6), 399)]

### Assignment 4: Bid Optimisation for Paid Traffic

**NEW MESSAGE**  (May 11, 2012)

Hi there,

I was trying to use our site on my mobile device the other
day, and the experience was not great.

Could you pull **conversion rates from session to order**, by
**device type**?

If desktop performance is better than on mobile we may be
able to bid up for desktop specifically to get more volume?



Thanks, Tom (Marketing Director)

In [48]:
%%sql
SELECT 
device_type,
COUNT(DISTINCT a.website_session_id) AS sessions,
COUNT(DISTINCT b.order_id) AS orders,
COUNT(DISTINCT b.order_id) / COUNT(DISTINCT a.website_session_id) AS conv_rate
FROM website_sessions a LEFT JOIN orders b
ON a.website_session_id = b.website_session_id
WHERE a.created_at < '2012-05-11'
AND utm_source ="gsearch" AND utm_campaign = "nonbrand"
GROUP BY device_type

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('desktop', 3911, 146, Decimal('0.0373')),
 ('mobile', 2492, 24, Decimal('0.0096'))]

### Assignment 5: Trending w/ Granular Segments

**NEW MESSAGE**  (June 09, 2012)

Hi there,

After your device-level analysis of conversion rates, we
realised desktop was doing well, so **we bid our gsearch
nonbrand desktop campaigns up on 2012-05-19.**

Could you pull **weekly trends for both desktop and mobile**
so we can see the impact on volume?

You can use 2012-04-15 until the bid change as a baseline.


Thanks, Tom (Marketing Director)

In [54]:
%%sql
SELECT MIN(DATE(created_at)) AS week_start_date,
COUNT(DISTINCT CASE WHEN device_type = "desktop" THEN website_session_id ELSE NULL END) AS dtop_sessions,
COUNT(DISTINCT CASE WHEN device_type = "mobile" THEN website_session_id ELSE NULL END) AS mob_sessions
FROM website_sessions
WHERE created_at > '2012-04-15' AND created_at < '2012-06-09'
AND utm_source ="gsearch" AND utm_campaign = "nonbrand"
GROUP BY YEAR(created_at), WEEK(created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
8 rows affected.

[(datetime.date(2012, 4, 15), 383, 238),
 (datetime.date(2012, 4, 22), 360, 234),
 (datetime.date(2012, 4, 29), 425, 256),
 (datetime.date(2012, 5, 6), 430, 282),
 (datetime.date(2012, 5, 13), 403, 214),
 (datetime.date(2012, 5, 20), 661, 190),
 (datetime.date(2012, 5, 27), 585, 183),
 (datetime.date(2012, 6, 3), 582, 157)]

## PART 2: Analysing Website Performance

### Assignment 1: Finding Top Website Pages

**NEW MESSAGE**  (June 09, 2012)

Hi there!

I’m Morgan, the new Website Manager.

Could you help me get my head around the site by pulling
the **most-viewed website pages, ranked by session volume?**

Thanks!

-Morgan (Website Manager)

In [65]:
%%sql
SELECT pageview_url, COUNT(DISTINCT website_pageview_id) AS sessions
FROM website_pageviews
WHERE created_at < '2012-06-09'
GROUP BY pageview_url
ORDER BY sessions DESC;

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
7 rows affected.

[('/home', 10403),
 ('/products', 4239),
 ('/the-original-mr-fuzzy', 3037),
 ('/cart', 1306),
 ('/shipping', 869),
 ('/billing', 716),
 ('/thank-you-for-your-order', 306)]

### Assignment 2: Finding Top Entry Pages

**NEW MESSAGE**  (June 12, 2012)

Hi there!

Would you be able to pull **a list of the top entry pages**? I
want to confirm where our users are hitting the site.

If you could **pull all entry pages and rank them on entry
volume**, that would be great.

Thanks!

-Morgan (Website Manager)

In [99]:
%%sql
SELECT pageview_url AS landing_page_url,
COUNT(DISTINCT website_pageview_id) AS sessions_hitting_page FROM website_pageviews a
INNER JOIN
(SELECT website_session_id, MIN(website_pageview_id) AS entry
FROM website_pageviews WHERE created_at < "2012-06-12"
GROUP BY website_session_id) b 
ON a.website_pageview_id = b.entry
GROUP BY pageview_url

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[('/home', 10714)]

### Assignment 3: Calculating Bounce Rates

**NEW MESSAGE**  (June 14, 2012)

Hi there!

The other day you showed us that **all of our traffic is landing
on the homepage** right now. We should check how that
landing page is performing.

Can you pull bounce rates for traffic landing on the
homepage? I would like to see three numbers…**Sessions,
Bounced Sessions**, and **% of Sessions which Bounced**
(aka “Bounce Rate”).

Thanks!

-Morgan (Website Manager)

In [125]:
%%sql
SELECT COUNT(a.website_session_id) AS sessions, 
SUM(CASE WHEN time = 1 AND b.pageview_url = "/home" THEN 1 ELSE 0 END) AS bounced_sessions,
SUM(CASE WHEN time = 1 AND b.pageview_url = "/home" THEN 1 ELSE 0 END) 
/ COUNT(a.website_session_id) AS bounce_rate
FROM
(SELECT website_session_id, MIN(website_pageview_id) entry, 
 COUNT(pageview_url) AS time FROM website_pageviews
WHERE created_at < "2012-06-14"
GROUP BY website_session_id) a
INNER JOIN
(SELECT website_pageview_id, pageview_url FROM website_pageviews) b
ON a.entry = b.website_pageview_id

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(11048, Decimal('6538'), Decimal('0.5918'))]

### Assignment 4: Analysing Landing Page Tests

**NEW MESSAGE**  (June 28, 2012)

Hi there!

Based on your bounce rate analysis, we ran a new custom
landing page (**/lander-1**) in a **50/50 test against the
homepage (/home)** for our gsearch nonbrand traffic.

Can you **pull bounce rates for the two groups** so we can
evaluate the new page? Make sure to **just look at the time
period where /lander-1 was getting traffic,** so that it is a fair
comparison.

Thanks, Morgan (Website Manager)

In [195]:
%%sql
SELECT b.pageview_url, COUNT(a.website_session_id) AS sessions, 
SUM(CASE WHEN time = 1 THEN 1 ELSE 0 END) AS bounced_sessions,
SUM(CASE WHEN time = 1 THEN 1 ELSE 0 END) / COUNT(a.website_session_id) AS bounce_rate
FROM
    (SELECT website_session_id, MIN(website_pageview_id) entry, 
     COUNT(pageview_url) AS time FROM website_pageviews
    WHERE created_at >= (SELECT MIN(created_at) FROM website_pageviews WHERE pageview_url = "/lander-1" ) 
    AND created_at < "2012-07-28"
    GROUP BY website_session_id) a
INNER JOIN
    (SELECT website_pageview_id, pageview_url FROM website_pageviews
    WHERE pageview_url in ("/home","/lander-1")) b
    ON a.entry = b.website_pageview_id
INNER JOIN
    (SELECT website_session_id, utm_source, utm_campaign FROM website_sessions
    WHERE utm_source = "gsearch" AND utm_campaign = "nonbrand") c
    ON a.website_session_id = c.website_session_id
GROUP BY b.pageview_url

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('/lander-1', 2316, Decimal('1233'), Decimal('0.5324')),
 ('/home', 2261, Decimal('1319'), Decimal('0.5834'))]

### Assignment 5: Landing Page Trend Analysis

**NEW MESSAGE**  (August 31, 2012)

Hi there!

Could you pull the volume of **paid search nonbrand traffic
landing on /home and /lander-1, trended weekly since June
1st?** I want to confirm the traffic is all routed correctly.

Could you also **pull our overall paid search bounce rate
trended weekly?** I want to make sure the lander change has
improved the overall picture.

Thanks, Morgan (Website Manager)

In [154]:
%%sql
SELECT MIN(DATE(start_date)) AS week_start_date,
SUM(CASE WHEN time = 1 THEN 1 ELSE 0 END) / COUNT(a.website_session_id) AS bounce_rate,
COUNT(CASE WHEN b.pageview_url = "/home" THEN a.website_session_id ELSE NULL END) AS home_sessions,
COUNT(CASE WHEN b.pageview_url = "/lander-1" THEN a.website_session_id ELSE NULL END) AS land_sessions
FROM
    (SELECT website_session_id, MIN(website_pageview_id) entry, MIN(DATE(created_at)) AS start_date,
     COUNT(pageview_url) AS time FROM website_pageviews
    WHERE created_at > "2012-06-01" AND created_at < "2012-08-31"
    GROUP BY website_session_id) a
INNER JOIN
    (SELECT website_pageview_id, pageview_url FROM website_pageviews
    WHERE pageview_url in ("/home","/lander-1")) b
    ON a.entry = b.website_pageview_id
INNER JOIN
    (SELECT website_session_id, utm_source, utm_campaign FROM website_sessions
    WHERE utm_source = "gsearch" AND utm_campaign = "nonbrand") c
    ON a.website_session_id = c.website_session_id
GROUP BY YEAR(start_date), WEEK(start_date)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
14 rows affected.

[(datetime.date(2012, 6, 1), Decimal('0.6057'), 175, 0),
 (datetime.date(2012, 6, 3), Decimal('0.5871'), 792, 0),
 (datetime.date(2012, 6, 10), Decimal('0.6160'), 875, 0),
 (datetime.date(2012, 6, 17), Decimal('0.5582'), 492, 350),
 (datetime.date(2012, 6, 24), Decimal('0.5828'), 369, 386),
 (datetime.date(2012, 7, 1), Decimal('0.5821'), 392, 388),
 (datetime.date(2012, 7, 8), Decimal('0.5668'), 390, 411),
 (datetime.date(2012, 7, 15), Decimal('0.5424'), 429, 421),
 (datetime.date(2012, 7, 22), Decimal('0.5138'), 402, 394),
 (datetime.date(2012, 7, 29), Decimal('0.4971'), 33, 995),
 (datetime.date(2012, 8, 5), Decimal('0.5382'), 0, 1087),
 (datetime.date(2012, 8, 12), Decimal('0.5140'), 0, 998),
 (datetime.date(2012, 8, 19), Decimal('0.5010'), 0, 1012),
 (datetime.date(2012, 8, 26), Decimal('0.5390'), 0, 833)]

### Assignment 6: Building Conversion Funnels

**NEW MESSAGE**  (September 05, 2012)

Hi there!

I’d like to understand where we lose our gsearch visitors
between the new /lander-1 page and placing an order. Can
you **build us a full conversion funnel, analysing how many
customers make it to each step?**

Start with **/lander-1** and build the funnel all the way to our
**thank you page**. Please use data since **August 5th**.

Thanks, Morgan (Website Manager)

In [3]:
%%sql
SELECT 
COUNT(DISTINCT a.sessions) AS sessions, 
SUM(a.to_products) AS to_products,
SUM(a.to_mrfuzzy) AS to_mrfuzzy,
SUM(a.to_cart) AS to_cart,
SUM(a.to_shipping) AS to_shipping,
SUM(a.to_billing) AS to_billing,
SUM(a.to_thankyou) AS to_thankyou

FROM
    (SELECT website_session_id AS sessions,
    CASE WHEN pageview_url = "/products" THEN 1 ELSE 0 END AS to_products,
    CASE WHEN pageview_url = "/the-original-mr-fuzzy" THEN 1 ELSE 0 END AS to_mrfuzzy,
    CASE WHEN pageview_url = "/cart" THEN 1 ELSE 0 END AS to_cart,
    CASE WHEN pageview_url = "/shipping" THEN 1 ELSE 0 END AS to_shipping,
    CASE WHEN pageview_url = "/billing" THEN 1 ELSE 0 END AS to_billing,
    CASE WHEN pageview_url = "/thank-you-for-your-order" THEN 1 ELSE 0 END AS to_thankyou
    FROM website_pageviews
    WHERE created_at > "2012-08-05" AND created_at < "2012-09-05" AND website_session_id NOT IN
        (SELECT website_session_id FROM website_pageviews
        WHERE created_at > "2012-08-05" AND created_at < "2012-09-05" AND pageview_url = "/home")
    ) a
INNER JOIN
    (SELECT website_session_id FROM website_sessions WHERE utm_source = "gsearch") b
ON a.sessions = b.website_session_id

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(4493, Decimal('2115'), Decimal('1567'), Decimal('683'), Decimal('455'), Decimal('361'), Decimal('158'))]

In [188]:
%%sql
SELECT 
SUM(a.to_products) / COUNT(DISTINCT a.sessions) AS lander_click_rt,
SUM(a.to_mrfuzzy) / SUM(a.to_products) AS products_click_rt,
SUM(a.to_cart) / SUM(a.to_mrfuzzy) AS mrfuzzy_click_rt,
SUM(a.to_shipping) / SUM(a.to_cart) AS cart_click_rt,
SUM(a.to_billing) / SUM(a.to_shipping) AS shipping_click_rt,
SUM(a.to_thankyou) / SUM(a.to_billing) AS billing_click_rt

FROM
    (SELECT website_session_id AS sessions,
    CASE WHEN pageview_url = "/products" THEN 1 ELSE 0 END AS to_products,
    CASE WHEN pageview_url = "/the-original-mr-fuzzy" THEN 1 ELSE 0 END AS to_mrfuzzy,
    CASE WHEN pageview_url = "/cart" THEN 1 ELSE 0 END AS to_cart,
    CASE WHEN pageview_url = "/shipping" THEN 1 ELSE 0 END AS to_shipping,
    CASE WHEN pageview_url = "/billing" THEN 1 ELSE 0 END AS to_billing,
    CASE WHEN pageview_url = "/thank-you-for-your-order" THEN 1 ELSE 0 END AS to_thankyou
    FROM website_pageviews
    WHERE created_at > "2012-08-05" AND created_at < "2012-09-05" AND website_session_id NOT IN
        (SELECT website_session_id FROM website_pageviews
        WHERE created_at > "2012-08-05" AND created_at < "2012-09-05" AND pageview_url = "/home")
    ) a
INNER JOIN
    (SELECT website_session_id FROM website_sessions WHERE utm_source = "gsearch") b
ON a.sessions = b.website_session_id

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(Decimal('0.4707'), Decimal('0.7409'), Decimal('0.4359'), Decimal('0.6662'), Decimal('0.7934'), Decimal('0.4377'))]

### Assignment 7: Analysing Conversion Funnel Tests

**NEW MESSAGE**  (November 10, 2012)

Hello!

We **tested an updated billing page** based on your funnel
analysis. Can you take a look and see whether **/billing-2** is
doing any better than the original **/billing** page?

We’re wondering **what % of sessions on those pages end up
placing an order.** FYI – we ran this test for **all traffic, not just
for our search visitors.**

Thanks!

Morgan (Website Manager)

In [209]:
%%sql
SELECT billing_version_seen, COUNT(DISTINCT website_session_id) AS sessions,
SUM(to_thankyou) AS orders,
SUM(to_thankyou) / COUNT(DISTINCT website_session_id) AS billing_to_order_rt

FROM
(SELECT website_session_id,
SUM(CASE WHEN pageview_url = "/thank-you-for-your-order" THEN 1 ELSE 0 END) AS to_thankyou,
CASE WHEN website_session_id in 
(SELECT DISTINCT website_session_id FROM website_pageviews WHERE pageview_url = "/billing") THEN "/billing"
ELSE "/billing-2" END AS billing_version_seen
FROM website_pageviews 
WHERE created_at >= (SELECT MIN(created_at) FROM website_pageviews WHERE pageview_url = "/billing-2" ) 
AND created_at < "2012-11-10"  AND website_session_id in 
    (SELECT DISTINCT website_session_id FROM website_pageviews 
     WHERE pageview_url = "/billing" OR pageview_url = "/billing-2")
GROUP BY website_session_id) a

GROUP BY billing_version_seen

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('/billing', 657, Decimal('300'), Decimal('0.4566')),
 ('/billing-2', 654, Decimal('410'), Decimal('0.6269'))]

## MID-COURSE PROJECT

**NEW MESSAGE**  (November 27, 2012)

Good morning,

I need some help preparing a presentation for the board
meeting next week.

The board would like to have a better understanding of our
growth story over our first 8 months. This will also be a
good excuse to show off our analytical capabilities a bit.

-Cindy (CEO)

### Question 1: 
Gsearch seems to be the biggest driver of our business. Could you pull **monthly trends** for **gsearch sessions and orders** so that we can showcase the growth there?

In [40]:
%%sql
SELECT MONTH(b.created_at) AS month, COUNT(b.website_session_id) AS session, COUNT(a.order_id) AS num_order,
COUNT(a.order_id) / COUNT(b.website_session_id) AS conv_rate
FROM orders a RIGHT JOIN website_sessions b ON a.website_session_id = b.website_session_id
WHERE b.created_at < "2012-11-27" AND b.utm_source = "gsearch"
GROUP BY YEAR(b.created_at), MONTH(b.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
9 rows affected.

[(3, 1860, 60, Decimal('0.0323')),
 (4, 3574, 92, Decimal('0.0257')),
 (5, 3410, 97, Decimal('0.0284')),
 (6, 3578, 121, Decimal('0.0338')),
 (7, 3811, 145, Decimal('0.0380')),
 (8, 4877, 184, Decimal('0.0377')),
 (9, 4491, 188, Decimal('0.0419')),
 (10, 5534, 234, Decimal('0.0423')),
 (11, 8889, 373, Decimal('0.0420'))]

### Question 2: 
Next, it would be great to see a similar monthly trend for Gsearch, but this time **splitting out nonbrand and brand campagins separately.** I am wondering if brand is picking up at all. If so, this is a good story to tell.

In [237]:
%%sql
SELECT c.utm_campaign,
MAX(CASE WHEN c.month = 3 THEN c.num_order END) AS Mar,
MAX(CASE WHEN c.month = 4 THEN c.num_order END) AS Apr,
MAX(CASE WHEN c.month = 5 THEN c.num_order END) AS May,
MAX(CASE WHEN c.month = 6 THEN c.num_order END) AS Jun,
MAX(CASE WHEN c.month = 7 THEN c.num_order END) AS Jul,
MAX(CASE WHEN c.month = 8 THEN c.num_order END) AS Aug,
MAX(CASE WHEN c.month = 9 THEN c.num_order END) AS Sep,
MAX(CASE WHEN c.month = 10 THEN c.num_order END) AS Oct,
MAX(CASE WHEN c.month = 11 THEN c.num_order END) AS Nov
FROM
(SELECT MONTH(a.created_at) AS month, b.utm_campaign, COUNT(a.order_id) AS num_order
FROM orders a INNER JOIN website_sessions b ON a.website_session_id = b.website_session_id
WHERE a.created_at < "2012-11-27" AND b.utm_source = "gsearch"
GROUP BY YEAR(a.created_at), MONTH(a.created_at), b.utm_campaign) c
GROUP BY c.utm_campaign

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('nonbrand', 60, 86, 91, 114, 136, 174, 172, 219, 356),
 ('brand', None, 6, 6, 7, 9, 10, 16, 15, 17)]

### Question 3: 
While we’re on Gsearch, could you dive into nonbrand, and pull **monthly sessions and orders split by device type?** I want to flex our analytical muscles a little and show the board we really know our traffic sources.

In [252]:
%%sql
SELECT c.device_type,
MAX(CASE WHEN c.month = 3 THEN c.num_order END) AS Mar,
MAX(CASE WHEN c.month = 4 THEN c.num_order END) AS Apr,
MAX(CASE WHEN c.month = 5 THEN c.num_order END) AS May,
MAX(CASE WHEN c.month = 6 THEN c.num_order END) AS Jun,
MAX(CASE WHEN c.month = 7 THEN c.num_order END) AS Jul,
MAX(CASE WHEN c.month = 8 THEN c.num_order END) AS Aug,
MAX(CASE WHEN c.month = 9 THEN c.num_order END) AS Sep,
MAX(CASE WHEN c.month = 10 THEN c.num_order END) AS Oct,
MAX(CASE WHEN c.month = 11 THEN c.num_order END) AS Nov
FROM
(SELECT MONTH(a.created_at) AS month, b.device_type, COUNT(a.order_id) AS num_order
FROM orders a INNER JOIN website_sessions b ON a.website_session_id = b.website_session_id
WHERE a.created_at < "2012-11-27" AND b.utm_source = "gsearch" AND b.utm_campaign = "nonbrand"
GROUP BY YEAR(a.created_at), MONTH(a.created_at), b.device_type) c
GROUP BY c.device_type

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('desktop', 50, 75, 83, 106, 122, 165, 155, 201, 323),
 ('mobile', 10, 11, 8, 8, 14, 9, 17, 18, 33)]

### Question 4: 
I’m worried that one of our more pessimistic board members may be concerned about the large % of traffic from Gsearch. Can you pull **monthly trends for Gsearch, alongside monthly trends for each of our other channels?**

In [256]:
%%sql
SELECT c.utm_source,
MAX(CASE WHEN c.month = 3 THEN c.num_order END) AS Mar,
MAX(CASE WHEN c.month = 4 THEN c.num_order END) AS Apr,
MAX(CASE WHEN c.month = 5 THEN c.num_order END) AS May,
MAX(CASE WHEN c.month = 6 THEN c.num_order END) AS Jun,
MAX(CASE WHEN c.month = 7 THEN c.num_order END) AS Jul,
MAX(CASE WHEN c.month = 8 THEN c.num_order END) AS Aug,
MAX(CASE WHEN c.month = 9 THEN c.num_order END) AS Sep,
MAX(CASE WHEN c.month = 10 THEN c.num_order END) AS Oct,
MAX(CASE WHEN c.month = 11 THEN c.num_order END) AS Nov
FROM
(SELECT MONTH(a.created_at) AS month, b.utm_source, COUNT(a.order_id) AS num_order
FROM orders a INNER JOIN website_sessions b ON a.website_session_id = b.website_session_id
WHERE a.created_at < "2012-11-27"
GROUP BY YEAR(a.created_at), MONTH(a.created_at), b.utm_source) c
GROUP BY c.utm_source

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
3 rows affected.

[('gsearch', 60, 92, 97, 121, 145, 184, 188, 234, 373),
 (None, None, 7, 11, 18, 22, 25, 25, 48, 42),
 ('bsearch', None, None, None, 1, 2, 19, 74, 89, 146)]

**Notice:**
When I first asked this question, I misunderstood the description of this question. Traffic refers to the number of distinct ```website_session_id```, not the number of distinct ```order_id```, but since the number of orders can also reflect interesting trends, the above code and result are retained here.

In [42]:
%%sql
SELECT utm_source,
MAX(CASE WHEN month = 3 THEN sessions END) AS Mar,
MAX(CASE WHEN month = 4 THEN sessions END) AS Apr,
MAX(CASE WHEN month = 5 THEN sessions END) AS May,
MAX(CASE WHEN month = 6 THEN sessions END) AS Jun,
MAX(CASE WHEN month = 7 THEN sessions END) AS Jul,
MAX(CASE WHEN month = 8 THEN sessions END) AS Aug,
MAX(CASE WHEN month = 9 THEN sessions END) AS Sep,
MAX(CASE WHEN month = 10 THEN sessions END) AS Oct,
MAX(CASE WHEN month = 11 THEN sessions END) AS Nov
FROM
(SELECT MONTH(created_at) AS month, utm_source, COUNT(website_session_id) AS sessions
FROM website_sessions
WHERE created_at < "2012-11-27"
GROUP BY YEAR(created_at), MONTH(created_at), utm_source) c
GROUP BY utm_source

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
3 rows affected.

[('gsearch', 1860, 3574, 3410, 3578, 3811, 4877, 4491, 5534, 8889),
 (None, 17, 149, 301, 360, 394, 515, 616, 868, 1021),
 ('bsearch', 2, 11, 25, 25, 44, 705, 1439, 1781, 2840)]

### Question 5: 
I’d like to tell the story of our website performance improvements over the course of the first 8 months. Could you pull **session to order conversion rates, by month?**

In [43]:
%%sql
SELECT year, month, COUNT(sessions) AS sessions, COUNT(orders) AS orders,
COUNT(orders) / COUNT(sessions) AS conv_rat
FROM
(SELECT DISTINCT a.website_session_id AS sessions, b.website_session_id AS orders, 
 YEAR(a.created_at) AS year, MONTH(a.created_at) AS month
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
WHERE a.created_at < "2012-11-27") c
GROUP BY year, month

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
9 rows affected.

[(2012, 3, 1879, 60, Decimal('0.0319')),
 (2012, 4, 3734, 99, Decimal('0.0265')),
 (2012, 5, 3736, 108, Decimal('0.0289')),
 (2012, 6, 3963, 140, Decimal('0.0353')),
 (2012, 7, 4249, 169, Decimal('0.0398')),
 (2012, 8, 6097, 228, Decimal('0.0374')),
 (2012, 9, 6546, 287, Decimal('0.0438')),
 (2012, 10, 8183, 371, Decimal('0.0453')),
 (2012, 11, 12750, 561, Decimal('0.0440'))]

### Question 6: 
For the gsearch lander test, please **estimate the revenue that test earned us (Hint:** Look at the increase in CVR 
from the test (Jun 19 – Jul 28), and use nonbrand sessions and revenue since then to calculate incremental value)

In [12]:
%%sql
SELECT billing_version_seen, COUNT(DISTINCT website_session_id) AS sessions,
SUM(to_thankyou) AS orders,
SUM(to_thankyou) / COUNT(DISTINCT website_session_id) AS billing_to_order_rt

FROM
(SELECT a.website_session_id,
SUM(CASE WHEN pageview_url = "/thank-you-for-your-order" THEN 1 ELSE 0 END) AS to_thankyou,
CASE WHEN a.website_session_id in 
(SELECT DISTINCT website_session_id FROM website_pageviews WHERE pageview_url = "/home") THEN "/home"
ELSE "/lander-1" END AS billing_version_seen
FROM website_pageviews a INNER JOIN website_sessions b ON a.website_session_id = b.website_session_id
WHERE a.created_at > "2012-06-19" AND a.created_at < "2012-07-28" 
 AND b.utm_source = "gsearch" AND b.utm_campaign = "nonbrand"
GROUP BY website_session_id) c

GROUP BY billing_version_seen

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('/home', 2261, Decimal('72'), Decimal('0.0318')),
 ('/lander-1', 2316, Decimal('94'), Decimal('0.0406'))]

In [4]:
%%sql
SELECT MAX(a.website_session_id), MAX(a.created_at) FROM website_pageviews a INNER JOIN website_sessions b 
ON a.website_session_id = b.website_session_id 
WHERE a.pageview_url = "/home" AND b.utm_source = "gsearch" AND b.utm_campaign = "nonbrand"
AND a.created_at < "2012-11-27"

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(17145, datetime.datetime(2012, 7, 29, 23, 48, 16))]

In [5]:
%%sql
SELECT COUNT(a.website_session_id) FROM website_pageviews a INNER JOIN website_sessions b 
ON a.website_session_id = b.website_session_id 
WHERE a.pageview_url = "/lander-1" AND b.utm_source = "gsearch" AND b.utm_campaign = "nonbrand"
AND a.website_session_id > 17145 AND a.created_at < "2012-11-27"

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(22972,)]

In [15]:
print("There are", round(22972 * (0.0406 - 0.0318)), "incremental orders since 7/29.")

There are 202 incremental orders since 7/29.

### Question 7: 
For the landing page test you analysed previously, it would be great to show a **full conversion funnel from each 
of the two pages to orders.** You can use the same time period you analysed last time (Jun 19 – Jul 28).

In [25]:
%%sql
SELECT
landing_page,
COUNT(DISTINCT a.sessions) AS sessions, 
SUM(a.to_products) AS to_products,
SUM(a.to_mrfuzzy) AS to_mrfuzzy,
SUM(a.to_cart) AS to_cart,
SUM(a.to_shipping) AS to_shipping,
SUM(a.to_billing) AS to_billing,
SUM(a.to_thankyou) AS to_thankyou

FROM
    (SELECT website_session_id AS sessions,
    CASE WHEN website_session_id in 
    (SELECT DISTINCT website_session_id FROM website_pageviews WHERE pageview_url = "/home") THEN "/home"
    ELSE "/lander-1" END AS landing_page,
    CASE WHEN pageview_url = "/products" THEN 1 ELSE 0 END AS to_products,
    CASE WHEN pageview_url = "/the-original-mr-fuzzy" THEN 1 ELSE 0 END AS to_mrfuzzy,
    CASE WHEN pageview_url = "/cart" THEN 1 ELSE 0 END AS to_cart,
    CASE WHEN pageview_url = "/shipping" THEN 1 ELSE 0 END AS to_shipping,
    CASE WHEN pageview_url = "/billing" THEN 1 ELSE 0 END AS to_billing,
    CASE WHEN pageview_url = "/thank-you-for-your-order" THEN 1 ELSE 0 END AS to_thankyou
    FROM website_pageviews
    WHERE created_at > "2012-06-19" AND created_at < "2012-07-28"
    ) a
INNER JOIN
    (SELECT website_session_id FROM website_sessions 
     WHERE utm_source = "gsearch" AND utm_campaign = "nonbrand") b
ON a.sessions = b.website_session_id

GROUP BY landing_page

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('/home', 2261, Decimal('942'), Decimal('684'), Decimal('296'), Decimal('200'), Decimal('168'), Decimal('72')),
 ('/lander-1', 2316, Decimal('1083'), Decimal('772'), Decimal('348'), Decimal('231'), Decimal('197'), Decimal('94'))]

### Question 8: 
I’d love for you to **quantify the impact of our billing test,** as well. Please analyse the lift generated from the test 
(Sep 10 – Nov 10), in terms of **revenue per billing page session,** and then pull the number of billing page sessions 
for the past month to understand monthly impact.

In [33]:
%%sql
SELECT billing_version_seen, COUNT(DISTINCT website_session_id) AS sessions,
SUM(price_usd) / COUNT(DISTINCT website_session_id) AS revenue_per_billing

FROM
    (SELECT a.website_session_id, b.price_usd,
    SUM(CASE WHEN a.pageview_url = "/thank-you-for-your-order" THEN 1 ELSE 0 END) AS to_thankyou,
    CASE WHEN a.website_session_id in 
    (SELECT DISTINCT website_session_id FROM website_pageviews WHERE pageview_url = "/billing") THEN "/billing"
    ELSE "/billing-2" END AS billing_version_seen
    FROM website_pageviews a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
    WHERE a.created_at >= "2012-09-10" AND a.created_at < "2012-11-10"  AND a.website_session_id in 
        (SELECT DISTINCT website_session_id FROM website_pageviews 
         WHERE pageview_url = "/billing" OR pageview_url = "/billing-2")
    GROUP BY a.website_session_id, b.price_usd) c

GROUP BY billing_version_seen

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('/billing', 657, Decimal('22.826484')),
 ('/billing-2', 654, Decimal('31.339297'))]

## PART 3: Analysis for Channel Portfolio Management

### Assignment 1: Analysing Channel Portfolios

**NEW MESSAGE**  (November 29, 2012)

Hi there,

With gsearch doing well and the site performing better, **we
launched a second paid search channel, bsearch**, around
August 22.

Can you pull **weekly trended session volume** since then and
**compare to gsearch nonbrand** so I can get a sense for how
important this will be for the business?

Thanks, Tom (Marketing Director)

In [57]:
%%sql
SELECT MIN(DATE(created_at)) AS weeek_start_date,
COUNT(DISTINCT CASE WHEN utm_source = "gsearch" THEN website_session_id ELSE NULL END) AS gsearch_sessions,
COUNT(DISTINCT CASE WHEN utm_source = "bsearch" THEN website_session_id ELSE NULL END) AS bsearch_sessions
FROM website_sessions
WHERE created_at > "2012-08-22" AND created_at < "2012-11-29" AND utm_campaign = "nonbrand"
GROUP BY YEAR(created_at), WEEK(created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
15 rows affected.

[(datetime.date(2012, 8, 22), 590, 197),
 (datetime.date(2012, 8, 26), 1056, 343),
 (datetime.date(2012, 9, 2), 925, 290),
 (datetime.date(2012, 9, 9), 951, 329),
 (datetime.date(2012, 9, 16), 1151, 365),
 (datetime.date(2012, 9, 23), 1050, 321),
 (datetime.date(2012, 9, 30), 999, 316),
 (datetime.date(2012, 10, 7), 1002, 330),
 (datetime.date(2012, 10, 14), 1257, 420),
 (datetime.date(2012, 10, 21), 1302, 431),
 (datetime.date(2012, 10, 28), 1211, 384),
 (datetime.date(2012, 11, 4), 1350, 429),
 (datetime.date(2012, 11, 11), 1246, 438),
 (datetime.date(2012, 11, 18), 3508, 1093),
 (datetime.date(2012, 11, 25), 2286, 774)]

### Assignment 2: Comparing Channel Characteristics

**NEW MESSAGE**  (November 30, 2012)

Hi there,

I’d like to learn more about the **bsearch nonbrand** campaign.
Could you please pull the **percentage of traffic coming on
Mobile**, and **compare that to gsearch**?

Feel free to dig around and share anything else you find
interesting. **Aggregate data since August 22nd** is great, no
need to show trending at this point. 

Thanks, Tom (Marketing Director)

In [52]:
%%sql
SELECT utm_source, COUNT(DISTINCT website_session_id) AS sessions,
COUNT(DISTINCT CASE WHEN device_type = "mobile" THEN website_session_id ELSE NULL END) AS mobile_sessions,
COUNT(DISTINCT CASE WHEN device_type = "mobile" THEN website_session_id ELSE NULL END)
/ COUNT(DISTINCT website_session_id) AS pct_mobile
FROM website_sessions
WHERE created_at > "2012-08-22" AND created_at < "2012-11-30" AND utm_campaign = "nonbrand"
GROUP BY utm_source

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('bsearch', 6522, 562, Decimal('0.0862')),
 ('gsearch', 20073, 4921, Decimal('0.2452'))]

### Assignment 3: Cross-Channel Bid Optimisation

**NEW MESSAGE**  (December 01, 2012)

Hi there,

I’m wondering if bsearch nonbrand should have the same
bids as gsearch. Could you pull **nonbrand conversion rates
from session to order for gsearch and bsearch, and slice the
data by device type**?

Please analyse data from **August 22** to **September 18**; we
ran a special pre-holiday campaign for gsearch starting on
**September 19th**, so the data after that isn’t fair game.

Thanks, Tom (Marketing Director)

In [56]:
%%sql
SELECT device_type, utm_source, COUNT(DISTINCT a.website_session_id) AS sessions,
COUNT(DISTINCT b.order_id) AS orders,
COUNT(DISTINCT b.order_id) / COUNT(DISTINCT a.website_session_id) AS conv_rate
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
WHERE a.created_at > "2012-08-22" AND a.created_at < "2012-09-19" AND utm_campaign = "nonbrand"
GROUP BY device_type, utm_source

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
4 rows affected.

[('desktop', 'bsearch', 1162, 44, Decimal('0.0379')),
 ('desktop', 'gsearch', 3011, 136, Decimal('0.0452')),
 ('mobile', 'bsearch', 130, 1, Decimal('0.0077')),
 ('mobile', 'gsearch', 1015, 13, Decimal('0.0128'))]

### Assignment 4: Analysing Channel Portfolio Trends

**NEW MESSAGE**  (December 22, 2012)

Hi there,

Based on your last analysis, we bid down bsearch nonbrand on
**December 2nd**.

Can you pull **weekly session volume for gsearch and bsearch
nonbrand, broken down by device, since November 4th**?

If you can **include a comparison metric to show bsearch as a
percent of gsearch** for each device, that would be great too. 

Thanks, Tom (Marketing Director)

In [63]:
%%sql
SELECT MIN(DATE(created_at)) AS weeek_start_date,
COUNT(DISTINCT CASE WHEN device_type = "desktop" AND utm_source = "gsearch" 
      THEN website_session_id ELSE NULL END) AS g_dtop_sessions,
COUNT(DISTINCT CASE WHEN device_type = "desktop" AND utm_source = "bsearch" 
      THEN website_session_id ELSE NULL END) AS b_dtop_sessions,

COUNT(DISTINCT CASE WHEN device_type = "desktop" AND utm_source = "bsearch" 
      THEN website_session_id ELSE NULL END) /
COUNT(DISTINCT CASE WHEN device_type = "desktop" AND utm_source = "gsearch" 
      THEN website_session_id ELSE NULL END) AS b_pct_of_g_dtop,

COUNT(DISTINCT CASE WHEN device_type = "mobile" AND utm_source = "gsearch" 
      THEN website_session_id ELSE NULL END) AS g_mob_sessions,
COUNT(DISTINCT CASE WHEN device_type = "mobile" AND utm_source = "bsearch" 
      THEN website_session_id ELSE NULL END) AS b_mob_sessions,

COUNT(DISTINCT CASE WHEN device_type = "mobile" AND utm_source = "bsearch" 
      THEN website_session_id ELSE NULL END) /
COUNT(DISTINCT CASE WHEN device_type = "mobile" AND utm_source = "gsearch" 
      THEN website_session_id ELSE NULL END) AS b_pct_of_g_mob

FROM website_sessions
WHERE created_at > "2012-11-04" AND created_at < "2012-12-22" AND utm_campaign = "nonbrand"
GROUP BY YEARWEEK(created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
7 rows affected.

[(datetime.date(2012, 11, 4), 1027, 400, Decimal('0.3895'), 323, 29, Decimal('0.0898')),
 (datetime.date(2012, 11, 11), 956, 401, Decimal('0.4195'), 290, 37, Decimal('0.1276')),
 (datetime.date(2012, 11, 18), 2655, 1008, Decimal('0.3797'), 853, 85, Decimal('0.0996')),
 (datetime.date(2012, 11, 25), 2058, 843, Decimal('0.4096'), 692, 62, Decimal('0.0896')),
 (datetime.date(2012, 12, 2), 1326, 517, Decimal('0.3899'), 396, 31, Decimal('0.0783')),
 (datetime.date(2012, 12, 9), 1277, 293, Decimal('0.2294'), 424, 46, Decimal('0.1085')),
 (datetime.date(2012, 12, 16), 1270, 348, Decimal('0.2740'), 376, 41, Decimal('0.1090'))]

### Assignment 5: Analysing Direct Traffic

**NEW MESSAGE**  (December 23, 2012)

Good morning,

A potential investor is asking if we’re building any
momentum with our brand or if we’ll need to keep relying
on paid traffic.

Could you **pull organic search, direct type in, and paid
brand search sessions by month**, and show those sessions
as a **% of paid search nonbrand**?

-Cindy (CEO)

In [79]:
%%sql 
SELECT YEAR(created_at), MONTH(created_at), 
COUNT(DISTINCT CASE WHEN utm_campaign = "nonbrand" THEN website_session_id ELSE NULL END) AS nobrand,
COUNT(DISTINCT CASE WHEN utm_campaign = "brand" THEN website_session_id ELSE NULL END) AS brand,

COUNT(DISTINCT CASE WHEN utm_campaign = "brand" THEN website_session_id ELSE NULL END) /
COUNT(DISTINCT CASE WHEN utm_campaign = "nonbrand" THEN website_session_id ELSE NULL END)
AS brand_pct_of_nonbrand,

COUNT(DISTINCT CASE WHEN http_referer IS NULL THEN website_session_id ELSE NULL END) AS direct,

COUNT(DISTINCT CASE WHEN http_referer IS NULL THEN website_session_id ELSE NULL END) /
COUNT(DISTINCT CASE WHEN utm_campaign = "nonbrand" THEN website_session_id ELSE NULL END)
AS direct_pct_of_nonbrand,

COUNT(DISTINCT CASE WHEN utm_source IS NULL AND http_referer IS NOT NULL 
      THEN website_session_id ELSE NULL END) AS organic,

COUNT(DISTINCT CASE WHEN utm_source IS NULL AND http_referer IS NOT NULL 
      THEN website_session_id ELSE NULL END) /
COUNT(DISTINCT CASE WHEN utm_campaign = "nonbrand" THEN website_session_id ELSE NULL END)
AS organic_pct_of_nonbrand

FROM website_sessions
WHERE created_at < "2012-12-23"
GROUP BY YEAR(created_at), MONTH(created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
10 rows affected.

[(2012, 3, 1852, 10, Decimal('0.0054'), 9, Decimal('0.0049'), 8, Decimal('0.0043')),
 (2012, 4, 3509, 76, Decimal('0.0217'), 71, Decimal('0.0202'), 78, Decimal('0.0222')),
 (2012, 5, 3295, 140, Decimal('0.0425'), 151, Decimal('0.0458'), 150, Decimal('0.0455')),
 (2012, 6, 3439, 164, Decimal('0.0477'), 170, Decimal('0.0494'), 190, Decimal('0.0552')),
 (2012, 7, 3660, 195, Decimal('0.0533'), 187, Decimal('0.0511'), 207, Decimal('0.0566')),
 (2012, 8, 5318, 264, Decimal('0.0496'), 250, Decimal('0.0470'), 265, Decimal('0.0498')),
 (2012, 9, 5591, 339, Decimal('0.0606'), 285, Decimal('0.0510'), 331, Decimal('0.0592')),
 (2012, 10, 6883, 432, Decimal('0.0628'), 440, Decimal('0.0639'), 428, Decimal('0.0622')),
 (2012, 11, 12260, 556, Decimal('0.0454'), 571, Decimal('0.0466'), 624, Decimal('0.0509')),
 (2012, 12, 6643, 464, Decimal('0.0698'), 482, Decimal('0.0726'), 492, Decimal('0.0741'))]

## PART 4: Analysing Business Patterns and Seasonality

### Assignment 1: Analysing Seasonality

**NEW MESSAGE**  (January 02, 2013)

Good morning,

2012 was a great year for us. As we continue to grow, we
should **take a look at 2012’s monthly and weekly volume
patterns**, to see if we can find any seasonal trends we
should plan for in 2013.

**If you can pull session volume and order volume**, that
would be excellent.

Thanks,

-Cindy (CEO)

In [84]:
%%sql
SELECT YEAR(a.created_at) AS yr, MONTH(a.created_at) AS mo,
COUNT(DISTINCT a.website_session_id) AS sessions,
COUNT(DISTINCT b.website_session_id) AS orders
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
WHERE a.created_at < "2013-01-01"
GROUP BY 1, 2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
10 rows affected.

[(2012, 3, 1879, 60),
 (2012, 4, 3734, 99),
 (2012, 5, 3736, 108),
 (2012, 6, 3963, 140),
 (2012, 7, 4249, 169),
 (2012, 8, 6097, 228),
 (2012, 9, 6546, 287),
 (2012, 10, 8183, 371),
 (2012, 11, 14011, 618),
 (2012, 12, 10072, 506)]

In [85]:
%%sql
SELECT MIN(DATE(a.created_at)) AS weeek_start_date,
COUNT(DISTINCT a.website_session_id) AS sessions,
COUNT(DISTINCT b.website_session_id) AS orders
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
WHERE a.created_at < "2013-01-01"
GROUP BY YEARWEEK(a.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
42 rows affected.

[(datetime.date(2012, 3, 19), 896, 25),
 (datetime.date(2012, 3, 25), 983, 35),
 (datetime.date(2012, 4, 1), 1193, 29),
 (datetime.date(2012, 4, 8), 1029, 28),
 (datetime.date(2012, 4, 15), 679, 22),
 (datetime.date(2012, 4, 22), 655, 18),
 (datetime.date(2012, 4, 29), 770, 19),
 (datetime.date(2012, 5, 6), 798, 17),
 (datetime.date(2012, 5, 13), 706, 23),
 (datetime.date(2012, 5, 20), 965, 28),
 (datetime.date(2012, 5, 27), 875, 31),
 (datetime.date(2012, 6, 3), 920, 34),
 (datetime.date(2012, 6, 10), 994, 29),
 (datetime.date(2012, 6, 17), 966, 37),
 (datetime.date(2012, 6, 24), 883, 32),
 (datetime.date(2012, 7, 1), 892, 30),
 (datetime.date(2012, 7, 8), 925, 36),
 (datetime.date(2012, 7, 15), 987, 47),
 (datetime.date(2012, 7, 22), 954, 41),
 (datetime.date(2012, 7, 29), 1172, 55),
 (datetime.date(2012, 8, 5), 1235, 48),
 (datetime.date(2012, 8, 12), 1181, 39),
 (datetime.date(2012, 8, 19), 1522, 55),
 (datetime.date(2012, 8, 26), 1593, 52),
 (datetime.date(2012, 9, 2), 1418, 56),
 (datetime.date(2012, 9, 9), 1488, 72),
 (datetime.date(2012, 9, 16), 1776, 76),
 (datetime.date(2012, 9, 23), 1624, 70),
 (datetime.date(2012, 9, 30), 1553, 67),
 (datetime.date(2012, 10, 7), 1632, 73),
 (datetime.date(2012, 10, 14), 1955, 93),
 (datetime.date(2012, 10, 21), 2042, 95),
 (datetime.date(2012, 10, 28), 1923, 82),
 (datetime.date(2012, 11, 4), 2086, 91),
 (datetime.date(2012, 11, 11), 1973, 101),
 (datetime.date(2012, 11, 18), 5130, 223),
 (datetime.date(2012, 11, 25), 4172, 179),
 (datetime.date(2012, 12, 2), 2727, 145),
 (datetime.date(2012, 12, 9), 2489, 123),
 (datetime.date(2012, 12, 16), 2718, 135),
 (datetime.date(2012, 12, 23), 1682, 74),
 (datetime.date(2012, 12, 30), 309, 21)]

### Assignment 2: Analysing Business Patterns

**NEW MESSAGE**  (January 05, 2013)

Good morning,

We’re considering adding live chat support to the website
to improve our customer experience. Could you analyse
the **average website session volume, by hour of day and
by day week**, so that we can staff appropriately?'

Let’s avoid the holiday time period and use a date range of
**Sep 15 - Nov 15, 2012**.

Thanks,

-Cindy (CEO)

In [96]:
%%sql
SELECT hr, 
ROUND(AVG(CASE WHEN wkday= 0 THEN website_sessions ELSE NULL END), 1) AS mon,
ROUND(AVG(CASE WHEN wkday= 1 THEN website_sessions ELSE NULL END), 1) AS tues,
ROUND(AVG(CASE WHEN wkday= 2 THEN website_sessions ELSE NULL END), 1) AS wed,
ROUND(AVG(CASE WHEN wkday= 3 THEN website_sessions ELSE NULL END), 1) AS thu,
ROUND(AVG(CASE WHEN wkday= 4 THEN website_sessions ELSE NULL END), 1) AS fri,
ROUND(AVG(CASE WHEN wkday= 5 THEN website_sessions ELSE NULL END), 1) AS sat,
ROUND(AVG(CASE WHEN wkday= 6 THEN website_sessions ELSE NULL END), 1) AS sun
FROM
    (SELECT
    DATE(created_at) AS created_date,
    WEEKDAY(created_at) AS wkday,
    HOUR(created_at) AS hr,
    COUNT(DISTINCT website_session_id) AS website_sessions
    FROM website_sessions
    WHERE created_at BETWEEN "2012-09-15" AND "2012-11-15"
    GROUP BY 1,2,3) a
GROUP BY 1
ORDER BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
24 rows affected.

[(0, Decimal('8.7'), Decimal('7.7'), Decimal('6.3'), Decimal('7.4'), Decimal('6.8'), Decimal('5.0'), Decimal('5.0')),
 (1, Decimal('6.6'), Decimal('6.7'), Decimal('5.3'), Decimal('4.9'), Decimal('7.1'), Decimal('5.0'), Decimal('3.0')),
 (2, Decimal('6.1'), Decimal('4.4'), Decimal('4.4'), Decimal('6.1'), Decimal('4.6'), Decimal('3.7'), Decimal('3.0')),
 (3, Decimal('5.7'), Decimal('4.0'), Decimal('4.7'), Decimal('4.6'), Decimal('3.6'), Decimal('3.9'), Decimal('3.4')),
 (4, Decimal('5.9'), Decimal('6.3'), Decimal('6.0'), Decimal('4.0'), Decimal('6.1'), Decimal('2.8'), Decimal('2.4')),
 (5, Decimal('5.0'), Decimal('5.4'), Decimal('5.1'), Decimal('5.4'), Decimal('4.6'), Decimal('4.3'), Decimal('3.9')),
 (6, Decimal('5.4'), Decimal('5.6'), Decimal('4.8'), Decimal('6.0'), Decimal('6.8'), Decimal('4.0'), Decimal('2.6')),
 (7, Decimal('7.3'), Decimal('7.8'), Decimal('7.4'), Decimal('10.6'), Decimal('7.0'), Decimal('5.7'), Decimal('4.8')),
 (8, Decimal('12.3'), Decimal('12.2'), Decimal('13.0'), Decimal('16.5'), Decimal('10.5'), Decimal('4.3'), Decimal('4.1')),
 (9, Decimal('17.6'), Decimal('15.7'), Decimal('19.6'), Decimal('19.3'), Decimal('17.5'), Decimal('7.6'), Decimal('6.0')),
 (10, Decimal('18.4'), Decimal('17.7'), Decimal('21.0'), Decimal('18.4'), Decimal('19.0'), Decimal('8.3'), Decimal('6.3')),
 (11, Decimal('18.0'), Decimal('19.1'), Decimal('24.9'), Decimal('21.6'), Decimal('20.9'), Decimal('7.2'), Decimal('7.7')),
 (12, Decimal('21.1'), Decimal('23.3'), Decimal('22.8'), Decimal('24.1'), Decimal('19.0'), Decimal('8.6'), Decimal('6.1')),
 (13, Decimal('17.8'), Decimal('23.0'), Decimal('20.8'), Decimal('20.6'), Decimal('21.6'), Decimal('8.1'), Decimal('8.4')),
 (14, Decimal('17.9'), Decimal('21.6'), Decimal('22.3'), Decimal('18.5'), Decimal('19.5'), Decimal('8.7'), Decimal('6.7')),
 (15, Decimal('21.6'), Decimal('17.1'), Decimal('25.3'), Decimal('23.5'), Decimal('21.3'), Decimal('6.9'), Decimal('7.1')),
 (16, Decimal('21.1'), Decimal('23.7'), Decimal('23.7'), Decimal('19.6'), Decimal('20.9'), Decimal('7.6'), Decimal('6.6')),
 (17, Decimal('19.4'), Decimal('15.9'), Decimal('20.2'), Decimal('19.8'), Decimal('12.9'), Decimal('6.4'), Decimal('7.6')),
 (18, Decimal('12.7'), Decimal('15.0'), Decimal('14.8'), Decimal('15.3'), Decimal('10.9'), Decimal('5.3'), Decimal('6.8')),
 (19, Decimal('12.4'), Decimal('14.1'), Decimal('13.3'), Decimal('11.6'), Decimal('14.3'), Decimal('7.1'), Decimal('6.4')),
 (20, Decimal('12.1'), Decimal('12.4'), Decimal('14.2'), Decimal('10.6'), Decimal('10.3'), Decimal('5.7'), Decimal('8.4')),
 (21, Decimal('9.1'), Decimal('12.6'), Decimal('11.4'), Decimal('9.4'), Decimal('7.3'), Decimal('5.7'), Decimal('10.2')),
 (22, Decimal('9.1'), Decimal('10.0'), Decimal('9.8'), Decimal('12.1'), Decimal('6.0'), Decimal('5.7'), Decimal('10.2')),
 (23, Decimal('8.8'), Decimal('8.6'), Decimal('9.6'), Decimal('10.6'), Decimal('7.6'), Decimal('5.3'), Decimal('8.3'))]

## PART 5: Product Analysis

### Assignment 1: Product-Level Sales Analysis

**NEW MESSAGE**  (January 04, 2013)

Good morning,

We’re about to launch a new product, and I’d like to do a
deep dive on our current flagship product.

Can you please **pull monthly trends to date** for **number of
sales, total revenue**, and **total margin generated** for the
business?

-Cindy (CEO)

In [102]:
%%sql
SELECT YEAR(created_at) AS yr, MONTH(created_at) AS mo, 
COUNT(DISTINCT order_id) AS number_of_sales,
SUM(price_usd) AS total_revenue,
SUM(price_usd - cogs_usd) AS total_margin
FROM orders WHERE created_at < "2013-01-04"
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
11 rows affected.

[(2012, 3, 60, Decimal('2999.40'), Decimal('1830.00')),
 (2012, 4, 99, Decimal('4949.01'), Decimal('3019.50')),
 (2012, 5, 108, Decimal('5398.92'), Decimal('3294.00')),
 (2012, 6, 140, Decimal('6998.60'), Decimal('4270.00')),
 (2012, 7, 169, Decimal('8448.31'), Decimal('5154.50')),
 (2012, 8, 228, Decimal('11397.72'), Decimal('6954.00')),
 (2012, 9, 287, Decimal('14347.13'), Decimal('8753.50')),
 (2012, 10, 371, Decimal('18546.29'), Decimal('11315.50')),
 (2012, 11, 618, Decimal('30893.82'), Decimal('18849.00')),
 (2012, 12, 506, Decimal('25294.94'), Decimal('15433.00')),
 (2013, 1, 42, Decimal('2099.58'), Decimal('1281.00'))]

In [103]:
%sql SELECT * FROM orders LIMIT 5

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
5 rows affected.

[(1, datetime.datetime(2012, 3, 19, 10, 42, 46), 20, 20, 1, 1, Decimal('49.99'), Decimal('19.49')),
 (2, datetime.datetime(2012, 3, 19, 19, 27, 37), 104, 104, 1, 1, Decimal('49.99'), Decimal('19.49')),
 (3, datetime.datetime(2012, 3, 20, 6, 44, 45), 147, 147, 1, 1, Decimal('49.99'), Decimal('19.49')),
 (4, datetime.datetime(2012, 3, 20, 9, 41, 45), 160, 160, 1, 1, Decimal('49.99'), Decimal('19.49')),
 (5, datetime.datetime(2012, 3, 20, 11, 28, 15), 177, 177, 1, 1, Decimal('49.99'), Decimal('19.49'))]

### Assignment 2: Analysing Product Launches

**NEW MESSAGE**  (April 05, 2013)

Good morning,

We launched our second product back on January 6th. Can
you pull together some trended analysis?

I’d like to see **monthly order volume**, **overall conversion
rates**, **revenue per session**, and a **breakdown of sales by
product**, all for the time period **since April 1, 2013**.

Thanks,

-Cindy (CEO)

In [109]:
%%sql
SELECT YEAR(a.created_at) AS yr, MONTH(a.created_at) AS mo,
COUNT(DISTINCT order_id) AS orders,
COUNT(DISTINCT order_id) / COUNT(DISTINCT a.website_session_id) AS conv_rate,
SUM(price_usd) / COUNT(DISTINCT a.website_session_id) AS revenue_per_session,
COUNT(CASE WHEN primary_product_id = 1 THEN order_id ELSE NULL END) AS product_one_orders,
COUNT(CASE WHEN primary_product_id = 2 THEN order_id ELSE NULL END) AS product_two_orders
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
WHERE a.created_at BETWEEN "2012-04-01" AND "2013-04-05"
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
13 rows affected.

[(2012, 4, 99, Decimal('0.0265'), Decimal('1.325391'), 99, 0),
 (2012, 5, 108, Decimal('0.0289'), Decimal('1.445107'), 108, 0),
 (2012, 6, 140, Decimal('0.0353'), Decimal('1.765985'), 140, 0),
 (2012, 7, 169, Decimal('0.0398'), Decimal('1.988305'), 169, 0),
 (2012, 8, 228, Decimal('0.0374'), Decimal('1.869398'), 228, 0),
 (2012, 9, 287, Decimal('0.0438'), Decimal('2.191740'), 287, 0),
 (2012, 10, 371, Decimal('0.0453'), Decimal('2.266441'), 371, 0),
 (2012, 11, 618, Decimal('0.0441'), Decimal('2.204969'), 618, 0),
 (2012, 12, 506, Decimal('0.0502'), Decimal('2.511412'), 506, 0),
 (2013, 1, 391, Decimal('0.0611'), Decimal('3.127025'), 344, 47),
 (2013, 2, 497, Decimal('0.0693'), Decimal('3.692108'), 335, 162),
 (2013, 3, 385, Decimal('0.0615'), Decimal('3.176269'), 320, 65),
 (2013, 4, 96, Decimal('0.0794'), Decimal('4.085227'), 82, 14)]

### Assignment 3: Product-Level Website Pathing

**NEW MESSAGE**  (April 06, 2014)

Hi there!

Now that we have a new product, I’m thinking about our
user path and conversion funnel. Let’s look at **sessions which
hit the /products page and see where they went next.**

Could you please pull **clickthrough rates from /products
since the new product launch on January 6th 2013**, by
product, and **compare to the 3 months leading up to launch
as a baseline?**

Thanks, Morgan (Website Manager)

In [33]:
%%sql
SELECT 
CASE WHEN created_at < "2013-01-06" THEN "A. Pre_Product_2" ELSE "B. Post_Product_2" END AS time_period,
COUNT(DISTINCT website_session_id) AS sessions,
COUNT(DISTINCT CASE WHEN pageview_url = "/the-original-mr-fuzzy" OR pageview_url = "/the-forever-love-bear"
     THEN website_session_id ELSE NULL END) AS w_next_pg,
COUNT(DISTINCT CASE WHEN pageview_url = "/the-original-mr-fuzzy" OR pageview_url = "/the-forever-love-bear"
     THEN website_session_id ELSE NULL END) / COUNT(DISTINCT website_session_id) AS pct_w_next_pg,
COUNT(DISTINCT CASE WHEN pageview_url = "/the-original-mr-fuzzy" THEN website_session_id ELSE NULL END)
     AS to_mrfuzzy,
COUNT(DISTINCT CASE WHEN pageview_url = "/the-original-mr-fuzzy" THEN website_session_id ELSE NULL END) /
     COUNT(DISTINCT website_session_id) AS pct_to_mrfuzzy,
COUNT(DISTINCT CASE WHEN pageview_url = "/the-forever-love-bear" THEN website_session_id ELSE NULL END)
     AS to_lovebear,
COUNT(DISTINCT CASE WHEN pageview_url = "/the-forever-love-bear" THEN website_session_id ELSE NULL END) /
     COUNT(DISTINCT website_session_id) AS pct_to_lovebear
FROM website_pageviews
WHERE website_session_id in
(SELECT website_session_id FROM website_pageviews
WHERE created_at BETWEEN "2012-10-06" AND "2013-04-06" AND pageview_url = "/products")
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('A. Pre_Product_2', 15696, 11346, Decimal('0.7229'), 11346, Decimal('0.7229'), 0, Decimal('0.0000')),
 ('B. Post_Product_2', 10710, 8201, Decimal('0.7657'), 6655, Decimal('0.6214'), 1546, Decimal('0.1444'))]

### Assignment 4: Building Product-Level Conversion Funnels

**NEW MESSAGE**  (April 10, 2014)

Hi there!

I’d like to look at our two products since January 6th and
analyse the **conversion funnels from each product page to
conversion.**

It would be great if you could produce a **comparison between
the two conversion funnels, for all website traffic.**

Thanks, Morgan (Website Manager)

In [17]:
%%sql
SELECT b.product_seen, COUNT(DISTINCT a.website_session_id) AS sessions,
COUNT(DISTINCT CASE WHEN pageview_url = "/cart" THEN a.website_session_id ELSE NULL END) AS to_cart,
COUNT(DISTINCT CASE WHEN pageview_url = "/shipping" THEN a.website_session_id ELSE NULL END) AS to_shipping,
COUNT(DISTINCT CASE WHEN pageview_url = "/billing-2" THEN a.website_session_id ELSE NULL END) AS to_billing,
COUNT(DISTINCT CASE WHEN pageview_url = "/thank-you-for-your-order" THEN a.website_session_id ELSE NULL END) 
AS to_thankyou

FROM
website_pageviews a
INNER JOIN
(SELECT website_session_id,
MAX(CASE WHEN pageview_url = "/the-forever-love-bear" THEN "loverbear" 
    ELSE "mrfuzzy" END) AS product_seen
FROM website_pageviews
WHERE created_at BETWEEN "2013-01-06" AND "2013-04-10" 
AND pageview_url in ("/the-forever-love-bear","/the-original-mr-fuzzy")
GROUP BY 1) b ON a.website_session_id = b.website_session_id
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('loverbear', 1599, 877, 603, 488, 301),
 ('mrfuzzy', 6985, 3038, 2084, 1710, 1088)]

In [18]:
%%sql
SELECT b.product_seen,

COUNT(DISTINCT CASE WHEN pageview_url = "/cart" THEN a.website_session_id ELSE NULL END) /
COUNT(DISTINCT a.website_session_id) AS product_page_click_rt,
COUNT(DISTINCT CASE WHEN pageview_url = "/shipping" THEN a.website_session_id ELSE NULL END) /
COUNT(DISTINCT CASE WHEN pageview_url = "/cart" THEN a.website_session_id ELSE NULL END) AS cart_click_rt,
COUNT(DISTINCT CASE WHEN pageview_url = "/billing-2" THEN a.website_session_id ELSE NULL END) /
COUNT(DISTINCT CASE WHEN pageview_url = "/shipping" THEN a.website_session_id ELSE NULL END) AS shipping_click_rt,
COUNT(DISTINCT CASE WHEN pageview_url = "/thank-you-for-your-order" THEN a.website_session_id ELSE NULL END) /
COUNT(DISTINCT CASE WHEN pageview_url = "/billing-2" THEN a.website_session_id ELSE NULL END) AS billing_click_rt

FROM
website_pageviews a
INNER JOIN
(SELECT website_session_id,
MAX(CASE WHEN pageview_url = "/the-forever-love-bear" THEN "loverbear" 
    ELSE "mrfuzzy" END) AS product_seen
FROM website_pageviews
WHERE created_at BETWEEN "2013-01-06" AND "2013-04-10" 
AND pageview_url in ("/the-forever-love-bear","/the-original-mr-fuzzy")
GROUP BY 1) b ON a.website_session_id = b.website_session_id
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('loverbear', Decimal('0.5485'), Decimal('0.6876'), Decimal('0.8093'), Decimal('0.6168')),
 ('mrfuzzy', Decimal('0.4349'), Decimal('0.6860'), Decimal('0.8205'), Decimal('0.6363'))]

### Assignment 5: Cross-Sell Analysis

**NEW MESSAGE**  (November 22, 2013)

Good morning,

On September 25th we started giving customers the **option
to add a 2nd product while on the /cart page**. Morgan says
this has been positive, but I’d like your take on it.

Could you please **compare the month before vs the month
after the change**? I’d like to see **CTR from the /cart page,
Avg Products per Order, AOV**, and overall **revenue per
/cart page view**.

Thanks, Cindy (CEO)

In [3]:
%%sql
SELECT a.time_period, cart_sessions, clickthroughs, cart_ctr, products_per_order, aov,
rev / cart_sessions AS rev_per_cart_session
FROM
(SELECT
 CASE WHEN created_at < "2013-09-25" THEN "A. Pre_Cross_Sell" ELSE "B. Post_Cross_Sell" END AS time_period,
 COUNT(DISTINCT CASE WHEN pageview_url = "/cart" THEN website_session_id ELSE NULL END) AS cart_sessions,
 COUNT(DISTINCT CASE WHEN pageview_url = "/shipping" THEN website_session_id ELSE NULL END) AS clickthroughs,
 COUNT(DISTINCT CASE WHEN pageview_url = "/shipping" THEN website_session_id ELSE NULL END) /
 COUNT(DISTINCT CASE WHEN pageview_url = "/cart" THEN website_session_id ELSE NULL END) AS cart_ctr
 FROM website_pageviews WHERE created_at BETWEEN "2013-08-25" AND "2013-10-25" GROUP BY 1) a
LEFT JOIN
(SELECT
 CASE WHEN created_at < "2013-09-25" THEN "A. Pre_Cross_Sell" ELSE "B. Post_Cross_Sell" END AS time_period,
 AVG(items_purchased) AS products_per_order, AVG(price_usd) AS aov, SUM(price_usd) AS rev
 FROM orders WHERE created_at BETWEEN "2013-08-25" AND "2013-10-25" GROUP BY 1) b
ON a.time_period = b.time_period

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('A. Pre_Cross_Sell', 1830, 1229, Decimal('0.6716'), Decimal('1.0000'), Decimal('51.416380'), Decimal('18.318842')),
 ('B. Post_Cross_Sell', 1975, 1351, Decimal('0.6841'), Decimal('1.0447'), Decimal('54.251848'), Decimal('18.431894'))]

### Assignment 6: Product Portfolio Expansion

**NEW MESSAGE**  (January 12, 2014)

Good morning,

On December 12th 2013, we launched a third product
targeting the birthday gift market (Birthday Bear).

Could you please run a **pre-post analysis comparing the
month before vs. the month after,** in terms of **session-to-order conversion rate, AOV, products per order**, and
**revenue per session**?

Thank you! Cindy (CEO)

In [37]:
%%sql
SELECT CASE WHEN a.created_at < "2013-12-12" THEN "A. Pre_Birthday_Bear" 
ELSE "B. Post_Birthday_Bear" END AS time_period,
COUNT(DISTINCT b.website_session_id) / COUNT(DISTINCT a.website_session_id) AS conv_rate,
AVG(price_usd) AS aov, AVG(items_purchased) AS products_per_order,
SUM(price_usd) / COUNT(DISTINCT a.website_session_id) AS revenue_per_session
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
WHERE a.created_at BETWEEN "2013-11-12" AND "2014-01-12"
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('A. Pre_Birthday_Bear', Decimal('0.0608'), Decimal('54.226502'), Decimal('1.0464'), Decimal('3.298677')),
 ('B. Post_Birthday_Bear', Decimal('0.0702'), Decimal('56.931319'), Decimal('1.1234'), Decimal('3.998763'))]

### Assignment 7: Analysing Product Refund Rates

**NEW MESSAGE**  (October 15, 2014)

Good morning,

Our Mr. Fuzzy supplier had some quality issues which
weren’t corrected until September 2013. Then they had a
major problem where the bears’ arms were falling off in
Aug/Sep 2014. As a result, we replaced them with a new
supplier on **September 16, 2014**.

Can you please pull **monthly product refund rates, by
product, and confirm our quality issues are now fixed**?

-Cindy (CEO)

In [48]:
%%sql
SELECT YEAR(a.created_at) AS yr, MONTH(a.created_at) AS mo,
COUNT(CASE WHEN a.product_id = 1 THEN a.order_item_id ELSE NULL END) AS p1_orders,
COUNT(CASE WHEN a.product_id = 1 THEN b.order_item_id ELSE NULL END)
/ COUNT(CASE WHEN a.product_id = 1 THEN a.order_item_id ELSE NULL END) AS p1_refund_rt,

COUNT(CASE WHEN a.product_id = 2 THEN a.order_item_id ELSE NULL END) AS p2_orders,
COUNT(CASE WHEN a.product_id = 2 THEN b.order_item_id ELSE NULL END)
/ COUNT(CASE WHEN a.product_id = 2 THEN a.order_item_id ELSE NULL END) AS p2_refund_rt,

COUNT(CASE WHEN a.product_id = 3 THEN a.order_item_id ELSE NULL END) AS p3_orders,
COUNT(CASE WHEN a.product_id = 3 THEN b.order_item_id ELSE NULL END)
/ COUNT(CASE WHEN a.product_id = 3 THEN a.order_item_id ELSE NULL END) AS p3_refund_rt,

COUNT(CASE WHEN a.product_id = 4 THEN a.order_item_id ELSE NULL END) AS p4_orders,
COUNT(CASE WHEN a.product_id = 4 THEN b.order_item_id ELSE NULL END)
/ COUNT(CASE WHEN a.product_id = 4 THEN a.order_item_id ELSE NULL END) AS p4_refund_rt
FROM order_items a LEFT JOIN order_item_refunds b ON a.order_item_id = b.order_item_id
WHERE a.created_at < "2014-10-15"
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
32 rows affected.

[(2012, 3, 60, Decimal('0.0167'), 0, None, 0, None, 0, None),
 (2012, 4, 99, Decimal('0.0505'), 0, None, 0, None, 0, None),
 (2012, 5, 108, Decimal('0.0370'), 0, None, 0, None, 0, None),
 (2012, 6, 140, Decimal('0.0571'), 0, None, 0, None, 0, None),
 (2012, 7, 169, Decimal('0.0828'), 0, None, 0, None, 0, None),
 (2012, 8, 228, Decimal('0.0746'), 0, None, 0, None, 0, None),
 (2012, 9, 287, Decimal('0.0906'), 0, None, 0, None, 0, None),
 (2012, 10, 371, Decimal('0.0728'), 0, None, 0, None, 0, None),
 (2012, 11, 618, Decimal('0.0744'), 0, None, 0, None, 0, None),
 (2012, 12, 506, Decimal('0.0593'), 0, None, 0, None, 0, None),
 (2013, 1, 343, Decimal('0.0496'), 47, Decimal('0.0213'), 0, None, 0, None),
 (2013, 2, 336, Decimal('0.0714'), 162, Decimal('0.0123'), 0, None, 0, None),
 (2013, 3, 320, Decimal('0.0563'), 65, Decimal('0.0462'), 0, None, 0, None),
 (2013, 4, 459, Decimal('0.0414'), 94, Decimal('0.0106'), 0, None, 0, None),
 (2013, 5, 489, Decimal('0.0634'), 82, Decimal('0.0244'), 0, None, 0, None),
 (2013, 6, 503, Decimal('0.0775'), 90, Decimal('0.0556'), 0, None, 0, None),
 (2013, 7, 509, Decimal('0.0727'), 95, Decimal('0.0316'), 0, None, 0, None),
 (2013, 8, 510, Decimal('0.0549'), 98, Decimal('0.0102'), 0, None, 0, None),
 (2013, 9, 537, Decimal('0.0428'), 98, Decimal('0.0102'), 0, None, 0, None),
 (2013, 10, 603, Decimal('0.0282'), 135, Decimal('0.0148'), 0, None, 0, None),
 (2013, 11, 724, Decimal('0.0345'), 174, Decimal('0.0230'), 0, None, 0, None),
 (2013, 12, 818, Decimal('0.0232'), 183, Decimal('0.0219'), 139, Decimal('0.0719'), 0, None),
 (2014, 1, 728, Decimal('0.0426'), 183, Decimal('0.0219'), 200, Decimal('0.0650'), 0, None),
 (2014, 2, 584, Decimal('0.0394'), 351, Decimal('0.0171'), 211, Decimal('0.0664'), 202, Decimal('0.0099')),
 (2014, 3, 785, Decimal('0.0306'), 193, Decimal('0.0155'), 244, Decimal('0.0697'), 205, Decimal('0.0049')),
 (2014, 4, 917, Decimal('0.0349'), 214, Decimal('0.0187'), 267, Decimal('0.0674'), 259, Decimal('0.0154')),
 (2014, 5, 1030, Decimal('0.0291'), 246, Decimal('0.0163'), 299, Decimal('0.0569'), 298, Decimal('0.0067')),
 (2014, 6, 893, Decimal('0.0571'), 245, Decimal('0.0367'), 288, Decimal('0.0556'), 249, Decimal('0.0241')),
 (2014, 7, 961, Decimal('0.0437'), 244, Decimal('0.0369'), 276, Decimal('0.0399'), 264, Decimal('0.0152')),
 (2014, 8, 958, Decimal('0.1378'), 237, Decimal('0.0169'), 294, Decimal('0.0680'), 303, Decimal('0.0066')),
 (2014, 9, 1056, Decimal('0.1326'), 251, Decimal('0.0319'), 317, Decimal('0.0662'), 327, Decimal('0.0122')),
 (2014, 10, 513, Decimal('0.0273'), 135, Decimal('0.0074'), 165, Decimal('0.0485'), 155, Decimal('0.0323'))]

## PART 6: User Analysis

### Assignment 1: Identifying Repeat Visitors

**NEW MESSAGE**  (November 01, 2014)

Hey there,

We’ve been thinking about customer value based solely on
their first session conversion and revenue. **But if customers
have repeat sessions, they may be more valuable than we
thought.** If that’s the case, we might be able to spend a bit
more to acquire them.

Could you please **pull data on how many of our website
visitors come back for another session? 2014 to date is good.**

Thanks, Tom (Marketing Director)

In [83]:
%%sql
SELECT sessions AS repeat_sessions, COUNT(user_id) AS users
FROM
(SELECT user_id, SUM(is_repeat_session) AS sessions FROM website_sessions 
 WHERE created_at BETWEEN "2014-01-01" AND "2014-11-01" 
 AND user_id in (SELECT user_id FROM website_sessions WHERE is_repeat_session = 0 
                 AND created_at BETWEEN "2014-01-01" AND "2014-11-01" ) GROUP BY 1) a
GROUP BY 1
ORDER BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
4 rows affected.

[(Decimal('0'), 126813),
 (Decimal('1'), 14086),
 (Decimal('2'), 315),
 (Decimal('3'), 4686)]

### Assignment 2: Analysing Time to Repeat

**NEW MESSAGE**  (November 03, 2014)

Ok, so the repeat session data was really interesting to see.

Now you’ve got me curious to better understand the behaviour
of these repeat customers.

Could you help me understand **the minimum, maximum, and
average time between the first and second session** for
customers who do come back? Again, **analysing 2014 to date**
is probably the right time period.

Thanks, Tom (Marketing Director)

In [91]:
%%sql
SELECT
AVG(DATEDIFF(b.second, a.first)) AS avg_days_first_to_second,
MIN(DATEDIFF(b.second, a.first)) AS min_days_first_to_second,
MAX(DATEDIFF(b.second, a.first)) AS max_days_first_to_second
FROM
(SELECT user_id, MIN(created_at) AS first FROM website_sessions 
 WHERE created_at BETWEEN "2014-01-01" AND "2014-11-03" 
 AND website_session_id in (SELECT website_session_id FROM website_sessions WHERE is_repeat_session = 0 
                 AND created_at BETWEEN "2014-01-01" AND "2014-11-03") GROUP BY 1) a
LEFT JOIN
(SELECT user_id, MIN(created_at) AS second FROM website_sessions 
 WHERE created_at BETWEEN "2014-01-01" AND "2014-11-03" 
 AND website_session_id in (SELECT website_session_id FROM website_sessions WHERE is_repeat_session = 1 
                 AND created_at BETWEEN "2014-01-01" AND "2014-11-03") GROUP BY 1) b
ON a.user_id = b.user_id LIMIT 200

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(Decimal('33.2622'), 1, 69)]

### Assignment 3: Analysing Repeat Channel Behaviour

**NEW MESSAGE**  (November 05, 2014)

Hi there,

Let’s do a bit more digging into our repeat customers.

Can you help me understand the channels they come back
through? Curious if it’s all direct type-in, or if we’re paying for
these customers with paid search ads multiple times.

**Comparing new vs. repeat sessions by channel** would be
really valuable, if you’re able to pull it! 2014 to date is great. 

Thanks, Tom (Marketing Director)

In [99]:
%%sql
SELECT
CASE
    WHEN utm_source IS NULL and http_referer IN ("https://www.gsearch.com", "https://www.bsearch.com") THEN "organic_search"
    WHEN utm_campaign = "nonbrand" THEN "paid_nonbrand"
    WHEN utm_campaign = "brand" THEN "paid_brand"
    WHEN utm_source IS NULL AND http_referer IS NULL THEN "direct_type_in"
    WHEN utm_source = "socialbook" THEN "paid_social"
END AS channel_group,
COUNT(CASE WHEN is_repeat_session = 0 THEN website_session_id ELSE NULL END) AS new_sessions,
COUNT(CASE WHEN is_repeat_session = 1 THEN website_session_id ELSE NULL END) AS repeat_sessions
FROM website_sessions
WHERE created_at BETWEEN "2014-01-01" AND "2014-11-05"
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
5 rows affected.

[('paid_nonbrand', 119950, 0),
 ('direct_type_in', 6591, 10564),
 ('organic_search', 7139, 11507),
 ('paid_brand', 6432, 11027),
 ('paid_social', 7652, 0)]

### Assignment 4: Analysing New & Repeat Conversion Rates

**NEW MESSAGE**  (November 08, 2014)

Hi there!

Sounds like you and Tom have learned a lot about our repeat
customers. Can I trouble you for one more thing?

I’d love to do a **comparison of conversion rates and revenue per
session for repeat sessions vs new sessions.**

Let’s continue using data from **2014, year to date.**

Thank you!

-Morganl (Website Manager)

In [104]:
%%sql
SELECT is_repeat_session, COUNT(a.website_session_id) AS sessions,
COUNT(b.website_session_id) / COUNT(a.website_session_id) AS conv_rate,
SUM(b.price_usd) / COUNT(a.website_session_id) AS rev_per_session
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
WHERE a.created_at BETWEEN "2014-01-01" AND "2014-11-08"
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[(0, 149787, Decimal('0.0680'), Decimal('4.343754')),
 (1, 33577, Decimal('0.0811'), Decimal('5.168828'))]

## FINAL PROJECT

**NEW MESSAGE**  (March 20, 2015)

Good morning!

Now that we’ve been in market for 3 years, we’ve generated
enough growth to raise a much larger round of venture
capital funding. We’re close to securing a large round from
one of the best West Coast firms.

I need your analytical skills to help me paint a picture of high
growth, and data-driven performance optimization.

Can you help?
-Cindy (CEO)

### Question 1: 
First, I’d like to show our volume growth. Can you pull overall session and order volume, trended by quarter 
for the life of the business? Since the most recent quarter is incomplete, you can decide how to handle it.

In [105]:
%%sql
SELECT YEAR(a.created_at) AS yr, QUARTER(a.created_at) AS qu,
COUNT(a.website_session_id) AS overall_session, COUNT(b.website_session_id) AS order_volume 
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
13 rows affected.

[(2012, 1, 1879, 60),
 (2012, 2, 11433, 347),
 (2012, 3, 16892, 684),
 (2012, 4, 32266, 1495),
 (2013, 1, 19833, 1273),
 (2013, 2, 24745, 1718),
 (2013, 3, 27663, 1840),
 (2013, 4, 40540, 2616),
 (2014, 1, 46779, 3069),
 (2014, 2, 53129, 3848),
 (2014, 3, 57141, 4035),
 (2014, 4, 76373, 5908),
 (2015, 1, 64198, 5420)]

### Question 2: 
Next, let’s showcase all of our efficiency improvements. I would love to show quarterly figures since we 
launched, for session-to-order conversion rate, revenue per order, and revenue per session.

In [107]:
%%sql
SELECT YEAR(a.created_at) AS yr, QUARTER(a.created_at) AS qu,
COUNT(b.website_session_id) / COUNT(a.website_session_id) AS se_or_cov_rat,
SUM(b.price_usd) / COUNT(b.website_session_id) AS rev_per_ord,
SUM(b.price_usd) / COUNT(a.website_session_id) AS rev_per_ses
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
13 rows affected.

[(2012, 1, Decimal('0.0319'), Decimal('49.990000'), Decimal('1.596275')),
 (2012, 2, Decimal('0.0304'), Decimal('49.990000'), Decimal('1.517233')),
 (2012, 3, Decimal('0.0405'), Decimal('49.990000'), Decimal('2.024222')),
 (2012, 4, Decimal('0.0463'), Decimal('49.990000'), Decimal('2.316217')),
 (2013, 1, Decimal('0.0642'), Decimal('52.142396'), Decimal('3.346809')),
 (2013, 2, Decimal('0.0694'), Decimal('51.538312'), Decimal('3.578211')),
 (2013, 3, Decimal('0.0665'), Decimal('51.734533'), Decimal('3.441114')),
 (2013, 4, Decimal('0.0645'), Decimal('54.715688'), Decimal('3.530741')),
 (2014, 1, Decimal('0.0656'), Decimal('62.160684'), Decimal('4.078136')),
 (2014, 2, Decimal('0.0724'), Decimal('64.374207'), Decimal('4.662462')),
 (2014, 3, Decimal('0.0706'), Decimal('64.494949'), Decimal('4.554298')),
 (2014, 4, Decimal('0.0774'), Decimal('63.793497'), Decimal('4.934885')),
 (2015, 1, Decimal('0.0844'), Decimal('62.799917'), Decimal('5.301965'))]

### Question 3: 
I’d like to show how we’ve grown specific channels. Could you pull a quarterly view of orders from Gsearch 
nonbrand, Bsearch nonbrand, brand search overall, organic search, and direct type-in?

In [109]:
%%sql
SELECT YEAR(a.created_at) AS yr, QUARTER(a.created_at) AS qu,
COUNT(CASE WHEN utm_source = "gsearch" AND utm_campaign = "nonbrand" THEN b.website_session_id ELSE NULL END) AS Gsearch_nonbrand,
COUNT(CASE WHEN utm_source = "bsearch" AND utm_campaign = "nonbrand" THEN b.website_session_id ELSE NULL END) AS Bsearch_nonbrand,
COUNT(CASE WHEN utm_campaign = "brand" THEN b.website_session_id ELSE NULL END) AS brand_search_overall,
COUNT(CASE WHEN utm_source IS NULL AND http_referer IN ("https://www.gsearch.com", "https://www.bsearch.com") 
      THEN b.website_session_id ELSE NULL END) AS organic_search,
COUNT(CASE WHEN utm_source IS NULL AND http_referer IS NULL THEN b.website_session_id ELSE NULL END) AS direct_type_in
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
13 rows affected.

[(2012, 1, 60, 0, 0, 0, 0),
 (2012, 2, 291, 0, 20, 15, 21),
 (2012, 3, 482, 82, 48, 40, 32),
 (2012, 4, 913, 311, 88, 94, 89),
 (2013, 1, 766, 183, 108, 125, 91),
 (2013, 2, 1114, 237, 114, 134, 119),
 (2013, 3, 1132, 245, 153, 167, 143),
 (2013, 4, 1657, 291, 248, 223, 197),
 (2014, 1, 1667, 344, 354, 338, 311),
 (2014, 2, 2208, 427, 410, 436, 367),
 (2014, 3, 2259, 434, 432, 445, 402),
 (2014, 4, 3248, 683, 615, 605, 532),
 (2015, 1, 3025, 581, 622, 640, 552)]

### Question 4: 
Next, let’s show the overall session-to-order conversion rate trends for those same channels, by quarter. 
Please also make a note of any periods where we made major improvements or optimizations.

In [110]:
%%sql
SELECT YEAR(a.created_at) AS yr, QUARTER(a.created_at) AS qu,
COUNT(CASE WHEN utm_source = "gsearch" AND utm_campaign = "nonbrand" THEN b.website_session_id ELSE NULL END) /
COUNT(CASE WHEN utm_source = "gsearch" AND utm_campaign = "nonbrand" THEN a.website_session_id ELSE NULL END) AS Gsearch_nonbrand,
COUNT(CASE WHEN utm_source = "bsearch" AND utm_campaign = "nonbrand" THEN b.website_session_id ELSE NULL END) /
COUNT(CASE WHEN utm_source = "bsearch" AND utm_campaign = "nonbrand" THEN a.website_session_id ELSE NULL END) AS Bsearch_nonbrand,
COUNT(CASE WHEN utm_campaign = "brand" THEN b.website_session_id ELSE NULL END) /
COUNT(CASE WHEN utm_campaign = "brand" THEN a.website_session_id ELSE NULL END) AS brand_search_overall,
COUNT(CASE WHEN utm_source IS NULL AND http_referer IN ("https://www.gsearch.com", "https://www.bsearch.com") 
      THEN b.website_session_id ELSE NULL END) /
COUNT(CASE WHEN utm_source IS NULL AND http_referer IN ("https://www.gsearch.com", "https://www.bsearch.com") 
      THEN a.website_session_id ELSE NULL END) AS organic_search,
COUNT(CASE WHEN utm_source IS NULL AND http_referer IS NULL THEN b.website_session_id ELSE NULL END) /
COUNT(CASE WHEN utm_source IS NULL AND http_referer IS NULL THEN a.website_session_id ELSE NULL END) AS direct_type_in
FROM website_sessions a LEFT JOIN orders b ON a.website_session_id = b.website_session_id
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
13 rows affected.

[(2012, 1, Decimal('0.0324'), None, Decimal('0.0000'), Decimal('0.0000'), Decimal('0.0000')),
 (2012, 2, Decimal('0.0284'), None, Decimal('0.0526'), Decimal('0.0359'), Decimal('0.0536')),
 (2012, 3, Decimal('0.0384'), Decimal('0.0408'), Decimal('0.0602'), Decimal('0.0498'), Decimal('0.0443')),
 (2012, 4, Decimal('0.0436'), Decimal('0.0497'), Decimal('0.0531'), Decimal('0.0539'), Decimal('0.0537')),
 (2013, 1, Decimal('0.0612'), Decimal('0.0693'), Decimal('0.0703'), Decimal('0.0753'), Decimal('0.0614')),
 (2013, 2, Decimal('0.0685'), Decimal('0.0690'), Decimal('0.0679'), Decimal('0.0760'), Decimal('0.0735')),
 (2013, 3, Decimal('0.0639'), Decimal('0.0697'), Decimal('0.0703'), Decimal('0.0734'), Decimal('0.0719')),
 (2013, 4, Decimal('0.0629'), Decimal('0.0601'), Decimal('0.0801'), Decimal('0.0694'), Decimal('0.0647')),
 (2014, 1, Decimal('0.0693'), Decimal('0.0704'), Decimal('0.0839'), Decimal('0.0756'), Decimal('0.0765')),
 (2014, 2, Decimal('0.0702'), Decimal('0.0695'), Decimal('0.0804'), Decimal('0.0797'), Decimal('0.0738')),
 (2014, 3, Decimal('0.0703'), Decimal('0.0698'), Decimal('0.0756'), Decimal('0.0733'), Decimal('0.0702')),
 (2014, 4, Decimal('0.0782'), Decimal('0.0841'), Decimal('0.0812'), Decimal('0.0784'), Decimal('0.0748')),
 (2015, 1, Decimal('0.0861'), Decimal('0.0850'), Decimal('0.0852'), Decimal('0.0821'), Decimal('0.0775'))]

### Question 5: 
We’ve come a long way since the days of selling a single product. Let’s pull monthly trending for revenue 
and margin by product, along with total sales and revenue. Note anything you notice about seasonality.

In [119]:
%%sql
SELECT YEAR(created_at) AS yr, MONTH(created_at) AS mo, 
SUM(CASE WHEN product_id = 1 THEN price_usd ELSE NULL END) AS mrfuzzy_rev,
SUM(CASE WHEN product_id = 1 THEN price_usd - cogs_usd ELSE NULL END) AS mrfuzzy_marg,
SUM(CASE WHEN product_id = 2 THEN price_usd ELSE NULL END) AS lovebear_rev,
SUM(CASE WHEN product_id = 2 THEN price_usd - cogs_usd ELSE NULL END) AS lovebear_marg,
SUM(CASE WHEN product_id = 3 THEN price_usd ELSE NULL END) AS birthdaybear_rev,
SUM(CASE WHEN product_id = 3 THEN price_usd - cogs_usd ELSE NULL END) AS birthdaybear_marg,
SUM(CASE WHEN product_id = 4 THEN price_usd ELSE NULL END) AS minibear_rev,
SUM(CASE WHEN product_id = 4 THEN price_usd - cogs_usd ELSE NULL END) AS minibear_marg,
SUM(price_usd) AS total_revenue,
SUM(price_usd - cogs_usd) AS total_margin
FROM order_items
GROUP BY 1,2
ORDER BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
37 rows affected.

[(2012, 3, Decimal('2999.40'), Decimal('1830.00'), None, None, None, None, None, None, Decimal('2999.40'), Decimal('1830.00')),
 (2012, 4, Decimal('4949.01'), Decimal('3019.50'), None, None, None, None, None, None, Decimal('4949.01'), Decimal('3019.50')),
 (2012, 5, Decimal('5398.92'), Decimal('3294.00'), None, None, None, None, None, None, Decimal('5398.92'), Decimal('3294.00')),
 (2012, 6, Decimal('6998.60'), Decimal('4270.00'), None, None, None, None, None, None, Decimal('6998.60'), Decimal('4270.00')),
 (2012, 7, Decimal('8448.31'), Decimal('5154.50'), None, None, None, None, None, None, Decimal('8448.31'), Decimal('5154.50')),
 (2012, 8, Decimal('11397.72'), Decimal('6954.00'), None, None, None, None, None, None, Decimal('11397.72'), Decimal('6954.00')),
 (2012, 9, Decimal('14347.13'), Decimal('8753.50'), None, None, None, None, None, None, Decimal('14347.13'), Decimal('8753.50')),
 (2012, 10, Decimal('18546.29'), Decimal('11315.50'), None, None, None, None, None, None, Decimal('18546.29'), Decimal('11315.50')),
 (2012, 11, Decimal('30893.82'), Decimal('18849.00'), None, None, None, None, None, None, Decimal('30893.82'), Decimal('18849.00')),
 (2012, 12, Decimal('25294.94'), Decimal('15433.00'), None, None, None, None, None, None, Decimal('25294.94'), Decimal('15433.00')),
 (2013, 1, Decimal('17146.57'), Decimal('10461.50'), Decimal('2819.53'), Decimal('1762.50'), None, None, None, None, Decimal('19966.10'), Decimal('12224.00')),
 (2013, 2, Decimal('16796.64'), Decimal('10248.00'), Decimal('9718.38'), Decimal('6075.00'), None, None, None, None, Decimal('26515.02'), Decimal('16323.00')),
 (2013, 3, Decimal('15996.80'), Decimal('9760.00'), Decimal('3899.35'), Decimal('2437.50'), None, None, None, None, Decimal('19896.15'), Decimal('12197.50')),
 (2013, 4, Decimal('22945.41'), Decimal('13999.50'), Decimal('5639.06'), Decimal('3525.00'), None, None, None, None, Decimal('28584.47'), Decimal('17524.50')),
 (2013, 5, Decimal('24445.11'), Decimal('14914.50'), Decimal('4919.18'), Decimal('3075.00'), None, None, None, None, Decimal('29364.29'), Decimal('17989.50')),
 (2013, 6, Decimal('25144.97'), Decimal('15341.50'), Decimal('5399.10'), Decimal('3375.00'), None, None, None, None, Decimal('30544.07'), Decimal('18716.50')),
 (2013, 7, Decimal('25444.91'), Decimal('15524.50'), Decimal('5699.05'), Decimal('3562.50'), None, None, None, None, Decimal('31143.96'), Decimal('19087.00')),
 (2013, 8, Decimal('25494.90'), Decimal('15555.00'), Decimal('5879.02'), Decimal('3675.00'), None, None, None, None, Decimal('31373.92'), Decimal('19230.00')),
 (2013, 9, Decimal('26844.63'), Decimal('16378.50'), Decimal('5879.02'), Decimal('3675.00'), None, None, None, None, Decimal('32723.65'), Decimal('20053.50')),
 (2013, 10, Decimal('30143.97'), Decimal('18391.50'), Decimal('8098.65'), Decimal('5062.50'), None, None, None, None, Decimal('38242.62'), Decimal('23454.00')),
 (2013, 11, Decimal('36192.76'), Decimal('22082.00'), Decimal('10438.26'), Decimal('6525.00'), None, None, None, None, Decimal('46631.02'), Decimal('28607.00')),
 (2013, 12, Decimal('40891.82'), Decimal('24949.00'), Decimal('10978.17'), Decimal('6862.50'), Decimal('6392.61'), Decimal('4378.50'), None, None, Decimal('58262.60'), Decimal('36190.00')),
 (2014, 1, Decimal('36392.72'), Decimal('22204.00'), Decimal('10978.17'), Decimal('6862.50'), Decimal('9198.00'), Decimal('6300.00'), None, None, Decimal('56568.89'), Decimal('35366.50')),
 (2014, 2, Decimal('29194.16'), Decimal('17812.00'), Decimal('21056.49'), Decimal('13162.50'), Decimal('9703.89'), Decimal('6646.50'), Decimal('6057.98'), Decimal('4141.00'), Decimal('66012.52'), Decimal('41762.00')),
 (2014, 3, Decimal('39242.15'), Decimal('23942.50'), Decimal('11578.07'), Decimal('7237.50'), Decimal('11221.56'), Decimal('7686.00'), Decimal('6147.95'), Decimal('4202.50'), Decimal('68189.73'), Decimal('43068.50')),
 (2014, 4, Decimal('45840.83'), Decimal('27968.50'), Decimal('12837.86'), Decimal('8025.00'), Decimal('12279.33'), Decimal('8410.50'), Decimal('7767.41'), Decimal('5309.50'), Decimal('78725.43'), Decimal('49713.50')),
 (2014, 5, Decimal('51489.70'), Decimal('31415.00'), Decimal('14757.54'), Decimal('9225.00'), Decimal('13751.01'), Decimal('9418.50'), Decimal('8937.02'), Decimal('6109.00'), Decimal('88935.27'), Decimal('56167.50')),
 (2014, 6, Decimal('44641.07'), Decimal('27236.50'), Decimal('14697.55'), Decimal('9187.50'), Decimal('13245.12'), Decimal('9072.00'), Decimal('7467.51'), Decimal('5104.50'), Decimal('80051.25'), Decimal('50600.50')),
 (2014, 7, Decimal('48040.39'), Decimal('29310.50'), Decimal('14637.56'), Decimal('9150.00'), Decimal('12693.24'), Decimal('8694.00'), Decimal('7917.36'), Decimal('5412.00'), Decimal('83288.55'), Decimal('52566.50')),
 (2014, 8, Decimal('47890.42'), Decimal('29219.00'), Decimal('14217.63'), Decimal('8887.50'), Decimal('13521.06'), Decimal('9261.00'), Decimal('9086.97'), Decimal('6211.50'), Decimal('84716.08'), Decimal('53579.00')),
 (2014, 9, Decimal('52789.44'), Decimal('32208.00'), Decimal('15057.49'), Decimal('9412.50'), Decimal('14578.83'), Decimal('9985.50'), Decimal('9806.73'), Decimal('6703.50'), Decimal('92232.49'), Decimal('58309.50')),
 (2014, 10, Decimal('58638.27'), Decimal('35776.50'), Decimal('17037.16'), Decimal('10650.00'), Decimal('16924.32'), Decimal('11592.00'), Decimal('11306.23'), Decimal('7728.50'), Decimal('103905.98'), Decimal('65747.00')),
 (2014, 11, Decimal('72535.49'), Decimal('44255.50'), Decimal('22616.23'), Decimal('14137.50'), Decimal('19545.75'), Decimal('13387.50'), Decimal('13465.51'), Decimal('9204.50'), Decimal('128162.98'), Decimal('80985.00')),
 (2014, 12, Decimal('79184.16'), Decimal('48312.00'), Decimal('23216.13'), Decimal('14512.50'), Decimal('24788.61'), Decimal('16978.50'), Decimal('17634.12'), Decimal('12054.00'), Decimal('144823.02'), Decimal('91857.00')),
 (2015, 1, Decimal('69586.08'), Decimal('42456.00'), Decimal('23636.06'), Decimal('14775.00'), Decimal('20695.50'), Decimal('14175.00'), Decimal('18293.90'), Decimal('12505.00'), Decimal('132211.54'), Decimal('83911.00')),
 (2015, 2, Decimal('55638.87'), Decimal('33946.50'), Decimal('38633.56'), Decimal('24150.00'), Decimal('18625.95'), Decimal('12757.50'), Decimal('16314.56'), Decimal('11152.00'), Decimal('129212.94'), Decimal('82006.00')),
 (2015, 3, Decimal('43191.36'), Decimal('26352.00'), Decimal('13377.77'), Decimal('8362.50'), Decimal('12095.37'), Decimal('8284.50'), Decimal('10286.57'), Decimal('7031.50'), Decimal('78951.07'), Decimal('50030.50'))]

### Question 6: 
Let’s dive deeper into the impact of introducing new products. Please pull monthly sessions to the /products 
page, and show how the % of those sessions clicking through another page has changed over time, along with 
a view of how conversion from /products to placing an order has improved.

In [129]:
%%sql
SELECT YEAR(created_at) AS yr, MONTH(created_at) AS mo,
COUNT(DISTINCT CASE WHEN pageview_url = "/products" THEN website_session_id ELSE NULL END) AS sessions_to_product_page,
COUNT(DISTINCT CASE WHEN pageview_url in ("/the-original-mr-fuzzy","/the-forever-love-bear","/the-birthday-sugar-panda",
                                         "/the-hudson-river-mini-bear") THEN website_session_id ELSE NULL END) AS clicked_to_next_page,
COUNT(DISTINCT CASE WHEN pageview_url in ("/the-original-mr-fuzzy","/the-forever-love-bear","/the-birthday-sugar-panda",
                                         "/the-hudson-river-mini-bear") THEN website_session_id ELSE NULL END)
/ COUNT(DISTINCT CASE WHEN pageview_url = "/products" THEN website_session_id ELSE NULL END) AS clickthrough_rt,
COUNT(DISTINCT CASE WHEN pageview_url = "/thank-you-for-your-order" THEN website_session_id ELSE NULL END) AS orders,
COUNT(DISTINCT CASE WHEN pageview_url = "/thank-you-for-your-order" THEN website_session_id ELSE NULL END)
/ COUNT(DISTINCT CASE WHEN pageview_url = "/products" THEN website_session_id ELSE NULL END) AS products_to_order_rt

FROM website_pageviews
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
37 rows affected.

[(2012, 3, 743, 530, Decimal('0.7133'), 60, Decimal('0.0808')),
 (2012, 4, 1447, 1029, Decimal('0.7111'), 99, Decimal('0.0684')),
 (2012, 5, 1584, 1135, Decimal('0.7165'), 108, Decimal('0.0682')),
 (2012, 6, 1752, 1247, Decimal('0.7118'), 140, Decimal('0.0799')),
 (2012, 7, 2018, 1438, Decimal('0.7126'), 169, Decimal('0.0837')),
 (2012, 8, 3012, 2198, Decimal('0.7297'), 228, Decimal('0.0757')),
 (2012, 9, 3126, 2258, Decimal('0.7223'), 287, Decimal('0.0918')),
 (2012, 10, 4030, 2948, Decimal('0.7315'), 371, Decimal('0.0921')),
 (2012, 11, 6743, 4849, Decimal('0.7191'), 618, Decimal('0.0917')),
 (2012, 12, 5013, 3620, Decimal('0.7221'), 506, Decimal('0.1009')),
 (2013, 1, 3380, 2595, Decimal('0.7678'), 390, Decimal('0.1154')),
 (2013, 2, 3685, 2803, Decimal('0.7607'), 498, Decimal('0.1351')),
 (2013, 3, 3371, 2576, Decimal('0.7642'), 385, Decimal('0.1142')),
 (2013, 4, 4362, 3356, Decimal('0.7694'), 553, Decimal('0.1268')),
 (2013, 5, 4684, 3609, Decimal('0.7705'), 571, Decimal('0.1219')),
 (2013, 6, 4600, 3536, Decimal('0.7687'), 593, Decimal('0.1289')),
 (2013, 7, 5020, 3890, Decimal('0.7749'), 604, Decimal('0.1203')),
 (2013, 8, 5226, 3951, Decimal('0.7560'), 608, Decimal('0.1163')),
 (2013, 9, 5399, 4072, Decimal('0.7542'), 629, Decimal('0.1165')),
 (2013, 10, 6038, 4564, Decimal('0.7559'), 708, Decimal('0.1173')),
 (2013, 11, 7886, 5900, Decimal('0.7482'), 861, Decimal('0.1092')),
 (2013, 12, 8840, 7026, Decimal('0.7948'), 1047, Decimal('0.1184')),
 (2014, 1, 7790, 6386, Decimal('0.8198'), 982, Decimal('0.1261')),
 (2014, 2, 7960, 6486, Decimal('0.8148'), 1021, Decimal('0.1283')),
 (2014, 3, 8110, 6669, Decimal('0.8223'), 1066, Decimal('0.1314')),
 (2014, 4, 9744, 7957, Decimal('0.8166'), 1241, Decimal('0.1274')),
 (2014, 5, 10261, 8466, Decimal('0.8251'), 1368, Decimal('0.1333')),
 (2014, 6, 10011, 8260, Decimal('0.8251'), 1239, Decimal('0.1238')),
 (2014, 7, 10837, 8958, Decimal('0.8266'), 1286, Decimal('0.1187')),
 (2014, 8, 10768, 8980, Decimal('0.8340'), 1325, Decimal('0.1230')),
 (2014, 9, 11128, 9154, Decimal('0.8226'), 1424, Decimal('0.1280')),
 (2014, 10, 12335, 10237, Decimal('0.8299'), 1609, Decimal('0.1304')),
 (2014, 11, 14476, 12020, Decimal('0.8303'), 1985, Decimal('0.1371')),
 (2014, 12, 17240, 14609, Decimal('0.8474'), 2314, Decimal('0.1342')),
 (2015, 1, 15217, 12992, Decimal('0.8538'), 2098, Decimal('0.1379')),
 (2015, 2, 14373, 12187, Decimal('0.8479'), 2068, Decimal('0.1439')),
 (2015, 3, 9022, 7723, Decimal('0.8560'), 1254, Decimal('0.1390'))]

### Question 7: 
We made our 4th product available as a primary product on December 05, 2014 (it was previously only a cross-sell 
item). Could you please pull sales data since then, and show how well each product cross-sells from one another?

In [133]:
%%sql
SELECT a.primary_product_id, b.product_id AS cross_sell_product,
COUNT(DISTINCT a.order_id) AS orders
FROM orders a LEFT JOIN order_items b
ON a.order_id = b.order_id AND b.is_primary_item = 0
WHERE a.created_at > "2014-12-05"
GROUP BY 1,2

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
16 rows affected.

[(1, None, 2743),
 (1, 2, 238),
 (1, 3, 553),
 (1, 4, 933),
 (2, None, 952),
 (2, 1, 25),
 (2, 3, 40),
 (2, 4, 260),
 (3, None, 597),
 (3, 1, 84),
 (3, 2, 40),
 (3, 4, 208),
 (4, None, 534),
 (4, 1, 16),
 (4, 2, 9),
 (4, 3, 22)]

In [138]:
%%sql
SELECT
    primary_product_id,
    COUNT(DISTINCT order_id) AS total_orders,
    COUNT(DISTINCT CASE WHEN cross_sell_product_id = 1 THEN order_id ELSE NULL END) AS _xsold_p1,
    COUNT(DISTINCT CASE WHEN cross_sell_product_id = 2 THEN order_id ELSE NULL END) AS _xsold_p2,
    COUNT(DISTINCT CASE WHEN cross_sell_product_id = 3 THEN order_id ELSE NULL END) AS _xsold_p3,
    COUNT(DISTINCT CASE WHEN cross_sell_product_id = 4 THEN order_id ELSE NULL END) AS _xsold_p4,

    COUNT(DISTINCT CASE WHEN cross_sell_product_id = 1 THEN order_id ELSE NULL END) / COUNT(DISTINCT order_id) AS p1_xsell_rt,
    COUNT(DISTINCT CASE WHEN cross_sell_product_id = 2 THEN order_id ELSE NULL END) / COUNT(DISTINCT order_id) AS p2_xsell_rt,
    COUNT(DISTINCT CASE WHEN cross_sell_product_id = 3 THEN order_id ELSE NULL END) / COUNT(DISTINCT order_id) AS p3_xsell_rt,
    COUNT(DISTINCT CASE WHEN cross_sell_product_id = 4 THEN order_id ELSE NULL END) / COUNT(DISTINCT order_id) AS p4_xsell_rt
FROM
(
SELECT a.*, b.product_id AS cross_sell_product_id
FROM orders a LEFT JOIN order_items b ON a.order_id = b.order_id AND b.is_primary_item = 0 WHERE a.created_at > "2014-12-05"
) c
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
4 rows affected.

[(1, 4467, 0, 238, 553, 933, Decimal('0.0000'), Decimal('0.0533'), Decimal('0.1238'), Decimal('0.2089')),
 (2, 1277, 25, 0, 40, 260, Decimal('0.0196'), Decimal('0.0000'), Decimal('0.0313'), Decimal('0.2036')),
 (3, 929, 84, 40, 0, 208, Decimal('0.0904'), Decimal('0.0431'), Decimal('0.0000'), Decimal('0.2239')),
 (4, 581, 16, 9, 22, 0, Decimal('0.0275'), Decimal('0.0155'), Decimal('0.0379'), Decimal('0.0000'))]